[
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "306bertw",
    "user_loc": "英国伦敦",
    "bubble": "50",
    "add_time": "2018年11月17日",
    "title": "Fantastic",
    "content": "A cultural highlight of Shanghai, don’t miss this - a fabulous garden of many rooms with various pavilions and pools. Believe it was built in the 17th century so a great survivor of old Shanghai. There is also a temple behind and a good shopping district around in a traditional and vibrant setting of small shops. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "jennybthomson",
    "user_loc": "澳大利亚布里斯班",
    "bubble": "40",
    "add_time": "2018年1月28日",
    "title": "Chinese tranquillity",
    "content": "Yu Gardens in Shanghai is a beautiful place of peace and tranquillity in the heart of Old China town in Shanghai. Typical Chinese buildings, feeding koi (large gold fish), dragon emblems along with beautifully maintained gardens offers the quintessential Chinese experience."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "KeithH82",
    "user_loc": "加拿大维多利亚",
    "bubble": "50",
    "add_time": "2018年2月20日",
    "title": "Simply amazing ",
    "content": "The day we visited was during the Chinese New Year so the place was insane! They had everyone going in one direction to make it easier. It really is a beautiful and amazing place though even with the crowds. In fact the crowds added to the appeal. There were a lot of giant colourful structures of mythical gods and animals in the open squares. This is a must do for Shanghai."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "adammilford",
    "bubble": "40",
    "add_time": "2018年11月17日",
    "title": "Crowded but peaceful ",
    "content": "Despite the crowds it was a really interesting place to visit and the history of the place can't help but shine through. There are plenty of little knocks where you can sit and escape the crowds."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "sleighcampbell",
    "user_loc": "俄勒冈本德",
    "bubble": "50",
    "add_time": "2018年11月15日",
    "title": "Great garden ",
    "content": "This is a 2000 year old garden that is kind of a maze. It is worth the small entrance fee charged. It is located in the middle of old Shanghai and you really don’t need a guide."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Voyager811386",
    "bubble": "50",
    "add_time": "2018年11月14日",
    "title": "Tourist Magnet",
    "content": "This area was really busy at the weekend, but quieter early on a weekday. We made a return visit in order to look properly at the buildings. They are very authentic and you would think they were really old rather than relatively recent constructions."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "elizabethbA6LC",
    "user_loc": "英国泰晤士河畔金斯敦",
    "bubble": "50",
    "add_time": "2018年11月13日",
    "title": "Afternoon excursion.",
    "content": "This exquisite garden is a window on the past. The buildings are exquisite and there are various nooks and crannies throughout. It is a restful, peaceful place well worth a visit."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "EBY_NYC",
    "user_loc": "纽约州纽约市",
    "bubble": "40",
    "add_time": "2018年11月13日",
    "title": "Crowded",
    "content": "We visited during Golden Week, and got to enjoy the crush of every time being on vacation along with the local tourists. Went for very pricy tea in a teashop above the garden. It was a nice break for all the hustle and bustle down below."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "429ImranA",
    "bubble": "40",
    "add_time": "2018年1月22日",
    "title": "Nice scenery ",
    "content": "Nice place to go for spending some time to admires Chinese architecture. Went on winter most of the trees are in winter state. I bet it is splendid on spring. To be honest i gave a star less due to the ticket personal and security guard was not friendly and rather rude. Other than that. Its an awesome place"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "moebeet8",
    "user_loc": "浙江省杭州市",
    "bubble": "40",
    "add_time": "2018年1月22日",
    "title": "If you want to see a Chinese garden...",
    "content": "If you don’t particularly enjoy gardens but would like to see one while in China, this is a great one. Semi compact garden with many beautiful flowers and trees. Nice any time a year but particularly in spring with the fresh blossom. They smell very good! There are fun books and crannies to explore with younger children and photo ops with fine examples of architecture within the garden walls. The surrounding area streets are also a draw and fun to roam. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "MariaR13267",
    "user_loc": "南卡罗来纳艾肯",
    "bubble": "50",
    "add_time": "2018年1月26日",
    "title": "Lovely, classical Chinese garden",
    "content": "Definitely worth a visit. This is a classical Chinese garden in a completely different style from traditional European gardens. Yes, it was crowded, but the harmonious plan and the emphasis on natural forms were evident. Our guide's explanation of the stone sculptures was truly enlightening. If we hadn't been with a group, I could easily lingered for hours enjoying this place."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "lkpmn",
    "user_loc": "澳大利亚墨尔本",
    "bubble": "40",
    "add_time": "2018年1月26日",
    "title": "Perfect for an easy stroll",
    "content": "The garden offered nice views and was affordable it was great to be able to take your time walking through the area and exploring different sections of the Garden depending on your pace it can take a little while to walk through."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "juliee850",
    "user_loc": "纽约州纽约市",
    "bubble": "40",
    "add_time": "2018年1月26日",
    "title": "Special place, but be prepared for crowds",
    "content": "From the photos I had seen, in particular of one of the tea houses on site, I had expected a tranquil experience of classic Chinese landscaping. Though the beauty was there, the crowds were as well and the experience was very different from expected. Definitely worth a visit but be prepared for crowds, even in the off season in bad weather, which is when we went. (We were also there on a Sunday, which would be a contributing factor; try a weekday if you can.) The garden is surrounded (inundated?) by souvenir shops, street food stalls, etc., but that appears par for the course."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Mr_MrsBeckett",
    "user_loc": "英国Foulridge",
    "bubble": "50",
    "add_time": "2018年2月5日",
    "title": "Really good afternoon out",
    "content": "We came here one afternoon after a recommendation. We had a good afternoon and the garden is very nice. Well kept and some interesting things to see. Very peaceful and not that busy when we visited."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "337alirezak",
    "bubble": "50",
    "add_time": "2018年2月5日",
    "title": "Yu Garden ",
    "content": "I can’t imagine if you to Shanghai and not visit this beautiful place, such nice architecture of old time and really Chinese way"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "DJLengYein",
    "bubble": "50",
    "add_time": "2018年1月22日",
    "title": "Beautiful bonzais",
    "content": "Beautiful plants and bonzais and koi fish and pond and architecture\nThey hve small shops that sells souvenirs as well as gifts that u can purchase"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "fayehannam",
    "user_loc": "澳大利亚Nagambie",
    "bubble": "50",
    "add_time": "2018年1月22日",
    "title": "Beauty beyond belief",
    "content": "Gardenia from shangaidriver.net took my husband, my sister and her husband to beautiful garden. It is full of history, culture and beauty."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "EkaterinaD_13",
    "bubble": "50",
    "add_time": "2018年1月21日",
    "title": "Has to visit ",
    "content": "Nice place for shopping and a walk for a day love to go there buy some silk and Chinese souvenirs place number 1 to visit in shanghai "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "LRoxana",
    "user_loc": "加利福尼亚山景城",
    "bubble": "50",
    "add_time": "2018年1月21日",
    "title": "A taste of Old Shanghai",
    "content": "Nice find among all the modern buildings! The market nearby is also a fun place to visit for food and souvenirs."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "tootatoota",
    "user_loc": "沙特阿拉伯Dhahran",
    "bubble": "50",
    "add_time": "2018年1月20日",
    "title": "nice new experiance",
    "content": "I recommend it for a new experience"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "teresahT430SN",
    "bubble": "40",
    "add_time": "2018年1月24日",
    "title": "Go, go there for the crowd in fact",
    "content": "The actual garden is lovely and for sure worth a visit. If you prefer peace and quiet, be sure to get there early, like by 7:30am. It will not be open yet. But something better is waiting for you: The 200+ years old HuXinTing tea house in the middle of the manmade lake. I will stay to the ground floor with the locals. It is also cheaper. Opposite the tea house, is the famous NanXiang dumplings. So here is the drill: get to Yu Yuan around 7:30am, have some dumplings, then have some tea, go to the Yu Garden. By the time you get out, you will see the crowds and start shopping. All kinds of Chinese souvenirs can be found there. People linger there for a day easily. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "buckeyecarly",
    "user_loc": "亚利桑那Buckeye",
    "bubble": "50",
    "add_time": "2018年1月24日",
    "title": "Beautiful spot in the middle of the city",
    "content": "Beware the Tea House scam in this area. We were approached by two young Chinese women who wanted to practice English. They enticed us to a special tea ceremony in a seedy area near the garden and we were ripped off for Yuan 1000 by the time we left."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "itshanns",
    "user_loc": "新加坡新加坡",
    "bubble": "40",
    "add_time": "2018年1月23日",
    "title": "nice garden nestled in the city",
    "content": "Nice garden to walk around and see the historic elements of chinese culture. its great to stop by from the hustle and bustle of the city"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "418hayleyp",
    "user_loc": "加利福尼亚拉古纳尼格",
    "bubble": "50",
    "add_time": "2018年1月22日",
    "title": "Worth the Small Fee For the Actual Garden",
    "content": "We walked around the touristy area for a while before realizing there is an actual 'Yu Garden' area that requires a fee- we almost opted out of going to the actual Yu Garden, but I'm so glad we didn't! It is much larger than you would expect and we found ourselves walking around in circles to make sure we didn't miss anything. There are some really beautiful spots in the garden and the history is very interesting - take the time to read some of the signs! As far as the touristy part of the Yu Garden, there's tons of souvenirs to purchase - we did have some trouble with finding food because we don't speak Chinese, no one spoke English, and none of the menus were in English. Would've loved to get a food recommendation before going (maybe ask your hotel!)."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "teon651",
    "user_loc": "上海市",
    "bubble": "40",
    "add_time": "2018年2月5日",
    "title": "Don't visit during national holidays or weekends",
    "content": "Yuyuyan Garden is a beautiful attraction and everybody wants to see it. There will be people trying to sell you stuff at high prices so I recommend you fight the urge. The pond area is very busy but the garden is peaceful."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "parac2014",
    "bubble": "10",
    "add_time": "2018年2月19日",
    "title": "Weakness of crowd control and frightened by visitors fighting at Underground station",
    "content": "Uncontrol of visitors pushing each others for trying to buy train tickets."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "N8495ZVamyh",
    "bubble": "40",
    "add_time": "2018年1月18日",
    "title": "Yu garden",
    "content": "Nice garden. Well worth a visit. NOTE: The entrance is hard to find. We wouldn't of found it some nice Chinese man didn't help. The entrance is in the middle of the markets, find the windy bridge path in the middle  :)"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "195wendym",
    "user_loc": "英国德比",
    "bubble": "50",
    "add_time": "2018年2月2日",
    "title": "Peace and tranquility",
    "content": "Built for his parents this garden took so long they never actually saw it finished.A beautiful place with so much to see it was amazing."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "M0nicaN0rway",
    "bubble": "40",
    "add_time": "2018年2月1日",
    "title": "Ok to take a look.",
    "content": "Nice to take a quick look, but the shopping area is not the best. recommend to go somewhere else for shopping."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "cmlarsen01",
    "user_loc": "德克萨斯州圣安东尼奥市",
    "bubble": "50",
    "add_time": "2018年1月30日",
    "title": "Beautiful Place",
    "content": "I have been to this garden twice, so that should tell you how much I enjoyed the place.  It is a haven for taking photos and you will see people from all over the world visiting this remarkable place."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "normamj",
    "bubble": "40",
    "add_time": "2018年1月28日",
    "title": "Beautiful garden",
    "content": "Unfortunately we bumped up with school trip so was too busy, too noisy but the garden is so beautiful."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "humu1",
    "user_loc": "加利福尼亚洛杉矶",
    "bubble": "50",
    "add_time": "2018年2月17日",
    "title": "Historic garden in the middle of the city",
    "content": "My family and I walked to the Yu Garden after visiting the Bund in the morning. It's probably a walk of a mile or two, but it was picturesque and very safe. The grounds and architecture are beautiful, which resulted in plenty of photographs. I also learned a great deal of Chinese history thanks to a myriad of English signage throughout the garden."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "HolidayKat_86",
    "user_loc": "澳大利亚墨尔本",
    "bubble": "50",
    "add_time": "2018年2月17日",
    "title": "Oasis in the middle of the skyscraper",
    "content": "This was one of our favourite things we did in Shanghai. The garden was like a peaceful oasis in the middle of Shanghai. There were several gardens to wander through, all traditional Chinese style with rockeries, lakes and bridges. Could easily spend a couple of hours here."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "EA59",
    "user_loc": "澳大利亚墨尔本",
    "bubble": "50",
    "add_time": "2018年2月17日",
    "title": "Pretty garden",
    "content": "Lovely place, inexpensive excursion. Was cold wet and slippery but if you walked carefully was not an issue. Located just near some great shops so a good afternoon outing."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "E1451ZXjoes",
    "user_loc": "英国伦敦",
    "bubble": "50",
    "add_time": "2018年2月14日",
    "title": "Best and busiest Garden in Asia",
    "content": "Certainly the busiest Garden with shopping areas in the biggest city of the world. Rule of thumb? Any goods in small shops cut the price to 1/3 or 1/2.  Must visit in Shanghai."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "HappyFeetUSA",
    "bubble": "40",
    "add_time": "2018年2月11日",
    "title": "Beautiful settings, serene...give it some time!",
    "content": "We managed to get in like 3 minutes before clowning was like 5pm...felt a little early. This is one interesting attraction going on forever. Easily can spend 3 hours. Quite a lot of history attached...So take your time...you won't be disappointed!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Relax30955",
    "bubble": "50",
    "add_time": "2004年11月17日",
    "title": "Everything But Serene",
    "content": "4 yellow circles for the Yuyuan garden, but 5 yellow circles for the trip to the Yuyuan garden. The garden itself was very cool. The big rockery (or bi grockery as the sign says) is a wonderful maze of rock pathways through rock gardens and rock streams. Lest the garden be composed entirely of rock, there are terraces and buildings constructed in the usual style, many plantings, and metal worked dragons and such. It is really quite beautiful. But it is not serene and you are not likely to get many good photographs. It was very crowded with European and Asian tour groups. And for good reason. It really is neat. My husband liked it too. You'll probably only be able to talk your husband into one garden visit in Shanghai, and this is the one you should choose. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Levendis",
    "bubble": "10",
    "add_time": "2009年9月27日",
    "title": "Lower your expectations!",
    "content": "The Yu Gardens were meant to be an example to be a Ming dynasty example of what a Chinese gentlemen's home look like. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "cortez48",
    "bubble": "50",
    "add_time": "2011年6月2日",
    "title": "shopping mecca.........",
    "content": "For 2 days now I`ve been attempting to go to see the Yu Gardens but everytime i enter this area i just want to shop!!! I love exploring little laneways and alleyways and the upper stories of non descript buildings groaning with trash & treasure. A walk around the local lanes you can see fresh produce, chickens, ducks I even saw an old toyota hiace van packed to the rafters with watermelons. I didnt see another tourist, got stared at a lot but definately worth doing if you have the time. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "globetrotterGoa",
    "user_loc": "印度果阿",
    "bubble": "40",
    "add_time": "2009年6月5日",
    "title": "great on all counts",
    "content": "we visited the garden in may 2009....it was part of a city tour but when we saw the garden and what all it had to offer we promptly went back after the tour ended....apart from the historical and cultural significance of the garden it is a shopper's delight....the entire area is a whimsical shoppers paradise...we bought a whole lot of traditional stuff from here...it has shops of everything touristy that one would like to carry back home....but pl pl do bargain....we picked up some amazing teapots...table runners...cushion covers....tops....footwear....calligraphy brushes...knick knacks etc...must visit and take a guide it really helps...entrance fee is only for the garden not the shopping and eating areas"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "MakatiSister",
    "bubble": "30",
    "add_time": "2008年11月24日",
    "title": "Yummy Street food around",
    "content": "They charge 40 RMB to enter the garden. Lots of fish pond, rocks and lovely plants. We walked all the way from the Subway stop LaoXiMen and walked for about 20 mins to get there but it was worth it because of all the food they offered in the complex. We took a long queue at Nanxiang Steamed Bun Restaurant to buy some xiaolong bao for 12RMB for 16 dumplings and 16rmb FOR 32 dumplings yum but be careful not to scald your togue with the juice from the dumplings. There's a food court that sell all kinds of dumplings, escargot, noodles, shaved ice dessert and other food stuff at the ground floor. Best selection of food I've seen."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "bigdass",
    "user_loc": "澳大利亚悉尼",
    "bubble": "50",
    "add_time": "2011年5月29日",
    "title": "Great shopping, forget the garden",
    "content": "Although the garden was pretty, the highlight is the shopping area in the surrounds. It was the best place to shop for bagains that we found in our trip to China."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Berdewelle",
    "user_loc": "英国Attleborough",
    "bubble": "40",
    "add_time": "2011年10月24日",
    "title": "Beautiful city centre retreat",
    "content": "lovely garden, impressive water feature, private opera pavillion, a relaxing visit."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Travelhound4",
    "user_loc": "加利福尼亚洛杉矶",
    "bubble": "40",
    "add_time": "2010年8月10日",
    "title": "The Bazaar is incredible !!!",
    "content": "Outside the garden is the the bazaar section where they have the shops. the food court and tea house. You have to try the dumplings and fried crab on a stick - yum yum. Have tea at the beautiful tea house on a pond in the middle of the bazaar. I don't know if it's the expo but there were so many people there that day we went. Like going to Disneyland during the summer. Very humid in July. Friendly people. Have fun haggling for purses, pearls and clothing. Its an attack on your senses. Enjoy the sights, the smells, the people and the food."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "gardenlover60",
    "bubble": "40",
    "add_time": "2008年1月1日",
    "title": "Ancient Chinese Garden Design",
    "content": "I went in the Spring during a holiday and there were hoards of people at all attractions. We visited the garden early in the morning so it was not too bad. The garden was lovely. Just walking through such an historical place was incredible. The combinations of materials (rock was predominate), the patterns on paths created with stone, the many different window patterns, the doors! There were so many different shaped doorways. There were so many combinations and juxtapositions of patterns, materials, plantings, and rocks (which I think I was told all came from the bottom of the lake at the Summer Palace. Can't verify that right now). The way the dragon's tail became the top of the undulating wall was amazing. Walls were built right over the tops of rocks. This garden is not just a garden. I wonder just how many hours of human labor went into the creation and the chore of keeping it up?"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "carpediem1605",
    "bubble": "50",
    "add_time": "2011年5月4日",
    "title": "Don't Miss Surrounding Lanes/Streets Too !",
    "content": "Stayed at Ibis Yuyuan, which is such a convenient location."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "lookingglass101",
    "bubble": "40",
    "add_time": "2010年7月15日",
    "title": "Very Nice Garden",
    "content": "The garden, buildings and bridges in the gardens are beautiful . There was a small fee to enter the gardens (a ticket window is by the entrance). The area around the gardens is very busy with many shops. We were there on a weekend in July, so it was very crowded, but we still found places to sit and relax. As with anywhere with crowds becareful, my friend was pickpocketed but again this can happen anywhere. We spent about 1.5 hrs here and felt we could see most of it, but you could take more time to relax and take photos. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "jcr98",
    "bubble": "40",
    "add_time": "2010年6月7日",
    "title": "Lovely garden, very peaceful.",
    "content": "The garden is a lovely and peaceful spot in the middle of noisy crowded Shanghai. Visit in the morning, and take you time meandering all the windy paths."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "yiping",
    "bubble": "30",
    "add_time": "2006年12月24日",
    "title": "accompanying my visitor friends",
    "content": "so many people on weekends...not a well organized attraction, but almost on very travel itinerary"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "JustOneCarryon",
    "bubble": "40",
    "add_time": "2006年9月2日",
    "title": "For fair-weather days",
    "content": "For oriental garden enthusiasts, this would be paradise. For a very hot summer day, there was quite a crowd, so I might have chosen a better time to visit. There are very few places within to get cover from sun/rain. During another time of year, this would be an ideal sightseeing opportunity for those who prefer a slow pace and want a break from the commotion of the city."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "me_likes_it",
    "bubble": "50",
    "add_time": "2010年4月17日",
    "title": "great place to escape from the craziness!",
    "content": "You're in Yuyuan, bargaining the last penny in your wallet for that silk (or sometimes \"silk\") robe. You head to the xiaolongbaos stalls to grab a bite and try to absorb the crowd, but that doesn't seem to suffice. You try starbucks then, but its packed too. So you head a bit further, cross a funky bridge, and you are in one of the most beautiful places of Shanghai: Yu garden! Beautiful architecture surrounded by lakes and trees. It is the ideal place to recharge!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Gorby",
    "user_loc": "菲律宾马尼拉",
    "bubble": "20",
    "add_time": "2006年5月29日",
    "title": "A Garden Is A Garden",
    "content": "What can I say? It's a garden....not much to see...but what's funny is that you'll see a lot of elderly people in the garden walking their BIRDS! I'm not kidding. The birds are in their cages but the concept is the same as walking a dog. Strange but interesting."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "KristinLynn",
    "user_loc": "威斯康星Port Washington",
    "bubble": "30",
    "add_time": "2010年1月24日",
    "title": "Under rennovation",
    "content": "Yu Garden is very beautiful from the outside. Unfortunately right now the Tea House is closed for rennovation for World Expo. Still definitly worth the trip but just a warning that you might not see it as it was meant to be until Expo starts up."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Ivy_Gong",
    "user_loc": "新加坡新加坡",
    "bubble": "40",
    "add_time": "2010年11月28日",
    "title": "Nice place with excellent XiaoLongBao!",
    "content": "Lots of things for shopping & window shopping!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "k_stylez",
    "bubble": "50",
    "add_time": "2010年11月9日",
    "title": "amazing!",
    "content": "There's something about this place that just makes me go here every time im in china. It has maze like structure which always appeals to foreigners because their curiosity takes over and the feeling of getting lost is always an excitement to some people..."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "aussiewanderers",
    "user_loc": "澳大利亚悉尼",
    "bubble": "20",
    "add_time": "2010年10月7日",
    "title": "Great shopping if new to China, otherwise a madhouse",
    "content": "After the Bund Sightseeing Tunnel, this is the biggest tourist trap in Shangha and really not worth visiting unless you are newly arrived in China, in which case it will appear to be spectacular and exciting in the absence of knowing anything better. The actual garden was first built to create a peaceful and calm environment for a Chinese family, which is quite ironic given that today it is completely surrounded by a modern commercial development (don't let the ancient appearance of the buildings fool you) and is invaded by hoards of Chinese and a lesser number of Western tourists at the height of the season. Even the garden itself (separated from the surrounding bazaar by a high wall) is no longer peaceful as it is very crowded with tourists."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "BinRoundDWorld",
    "bubble": "40",
    "add_time": "2010年9月27日",
    "title": "Fun and crowded shopping area",
    "content": "Very fun area to stroll around in, with interesting old Chinese architecture all around. Unfortunately, we never found where the \"pond\" and non-shopping elements of YuYuan Gardens were located. They must not be easy to locate."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "froghollow20",
    "bubble": "50",
    "add_time": "2011年11月5日",
    "title": "within walking distance of The Bund",
    "content": "A lovely Chinese garden in the Old City. The only flower when we were there was the osmanthus and the perfume was lovely. It would be interesting to see this garden in the spring. Some of the trees are very old. The buildings were fascinating and there are 100s of photo opportunities."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "mattitude",
    "user_loc": "加利福尼亚圣地亚哥",
    "bubble": "40",
    "add_time": "2011年9月22日",
    "title": "Great Souvenir Shopping",
    "content": "I've been to Yu Yuan Garden twice and enjoyed the experience both times. There are lots and lots of opportunities to buy souvenirs for family and friends back home. Be prepared to haggle and don't even consider buying for less than half of the original offer from the vendors. There's a Dim Sum place in the interior section of Yu Yuan called XiaoLongBao I believe. The line was incredibly long, but I had time to kill and decided to go ahead and wait. I figured that there must be reason that literally hundreds of locals were lined for dumplings. The staff didn't speak any English and I ordered by basically pointing to some dumplings that looked like every other dumpling. I have no idea what the filling was (pork and seafood maybe) but they were very, very good. If you have a free afternoon, you should definitely check out Yu Yuan Garden."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "atob",
    "bubble": "30",
    "add_time": "2011年9月14日",
    "title": "Mobbed with tourists but good if you can find a quiet area",
    "content": "This place is quite interesting and certainly very pretty however you can't enjoy it as it is so mobbed with people. We managed to find a quiet corner which was relaxing. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AMNH",
    "bubble": "50",
    "add_time": "2011年9月13日",
    "title": "A Beautiful Chinese Garden at a Popular Shopping Area",
    "content": "My friend and I didn't plan to visit Yu Yuan actually. We went to Cheng Huang Miao for the famous steamed buns and found out that Yu Yuan Garden was nearby. We were so glad that we got to visit this lovely rock garden. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Stephanie_007",
    "user_loc": "日本东京",
    "bubble": "40",
    "add_time": "2011年9月12日",
    "title": "A Beautiful Traditional Chinese Garden",
    "content": "I’m so glad we took the time to do this while in Shanghai. The Garden was a wonderful example of a traditional Chinese Garden and was absolutely lovely. I highly recommend taking the time to visit it if you have time to spare in Shanghai. Also, there is plenty of shopping just outside the gate."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Two_Travel_Bugs_WI",
    "user_loc": "威斯康星Franklin",
    "bubble": "50",
    "add_time": "2011年7月29日",
    "title": "Beautiful - a must do in Shanghai!!",
    "content": "I was in Shanghai on business, and had time scattered between meetings to see the city. A colleague mentioned the going to Yu Yuan Garden would be worth my time. It certainly was! I spent a whole afternoon, just whiling away the hours, in wonderment of the buildings, the greenery, the rock formations, the waterscapes. It was great to be outside, and find a quieter, calmer area to recollect one's self while in the middle of the vastness of Shanghai. Definitely would recommend a visit."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Pbiamino",
    "bubble": "50",
    "add_time": "2011年7月17日",
    "title": "A highlight, it allows you to skip suzhou",
    "content": "If you want to have a idea of what is a classic chinese garden or just want to rest after strolling around the crowded old city you shall visit this garden. We visited the famous gardens in suzhou and we prefer yu garden, it also allows you to avoid the hassle of a trip outside shanghai. After visiting yu garden you may have lunch at the delicious nanxiang steamed bun restaurant, it is just a few steps away."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "alicevarren",
    "user_loc": "哥伦比亚特区华盛顿特区",
    "bubble": "40",
    "add_time": "2011年6月25日",
    "title": "Lovely but better in an off-season",
    "content": "This is one of the major attractions in Shanghai and a must-see. The garden is situated in the middle of busy shops and eateries full of tourists. Even though it's crowded, it's charming in its own way. There are a variety of souvenirs, clothing, tea, and other nicknacks you can buy here. I would recommend, though, that if you're on a budget to go to markets in other markets outside of the tourist-ridden places. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "py_bh",
    "user_loc": "新加坡新加坡",
    "bubble": "10",
    "add_time": "2011年6月17日",
    "title": "Not Worth",
    "content": "The surrounding is worth the trip but definitely NOT the garden. The Nanxiang XLB is nice, and worth the try. Shopping is crazy there, but remember to bargain."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "bahama234",
    "user_loc": "香港",
    "bubble": "40",
    "add_time": "2011年11月29日",
    "title": "Nice place",
    "content": "It is one of the attraction points in old town. Typical old Chinese style building with beautiful screenary. But the admission ticket RMB40 is a bit expensive."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "rob50Uk",
    "bubble": "30",
    "add_time": "2011年10月23日",
    "title": "All a bit samey",
    "content": "This was a good day trip and the surrounding area very touristy. Many Chinese toursit attractions are however a little bit samey and this is no exception. Worth the trip for the immediate surrounding area though. Very cheap admission."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "matthewbT9247JI",
    "user_loc": "瑞士",
    "bubble": "50",
    "add_time": "2011年10月20日",
    "title": "A little piece of the 'real' China",
    "content": "Quite retreat in the middle of chaos. I enjoyed a stroll around the gardens for an hour, and whilst it wasn't green, the water and pathways were very relaxing."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "shesuwat",
    "user_loc": "澳大利亚布里斯班",
    "bubble": "40",
    "add_time": "2011年10月20日",
    "title": "Gardens and Old town",
    "content": "The Gardens are very pretty, we accessed them through a shopping complex in the Old Town which had many souvenir shops and food outlets. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "avatarNY",
    "bubble": "40",
    "add_time": "2011年12月10日",
    "title": "Be sure and venture off the beaten track",
    "content": "Yu Garden is probably on most visitors lists as a \"must see.\" Some will walk away saying \"what a tourist trap,\" and others who take the time to venture outside of the ridicuously crowded main areas...will find some pretty good shopping. Truly, Yu Garden is beautiful...Although garden is a bit of misnomer. It is an area of restored old buildings with a central water garden. The intricacy of the workmanship on the buildings is pretty amazing...if you take the time to look at it...and you are not be overwhelmed by the crowds. The main dumpling restaurant (world famous) is worth a wait. It is easy to find as the cue for their takeout window is often a 100 meters long. Sometimes waiting for a table upstairs is shorter than takeout. As the title of my review says... i recommend exploring the areas outside the actual boundries of Yu Garden. Clearly, this area developed to service the overflow of tourists... but some pretty good shopping can be found if you adventure around the Luijiabang area."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "NeptunesExpress",
    "user_loc": "澳大利亚布里斯班",
    "bubble": "40",
    "add_time": "2011年10月9日",
    "title": "Worth a visit",
    "content": "If you have time really worth a visit and an easy walk from the south end of the Bund."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "sa54d",
    "bubble": "40",
    "add_time": "2011年10月8日",
    "title": "400 year old Ming Dynasty Garden - inside a mall",
    "content": "They built a shopping mall around this huge, beautiful centuries-old garden. That is why I had such a hard time finding it. I had a map and I know how to read Chinese. Every time I thought I found it I looked at the entrance to a shopping mall and thought I read my map wrong. Finally I saw a sign to follow. I thought the series of \"Yu Yuan Garden\" signs would lead me through the mall but they led me deeper into it until I found it. This is the best advice I can give: it's actually inside a mall. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "chrisjw4",
    "user_loc": "德克萨斯州圣安东尼奥市",
    "bubble": "30",
    "add_time": "2011年10月5日",
    "title": "OK, but don't linger in Shanghai for this",
    "content": "Mobbed with crowds. Quiet spots are hard to come by. Nice change of scenery from the rest of Shanghai, but other gardens in China are much better. If you are creating your own itinerary, make time for West Lake in Hangzhou or the Summer Palace in Beijing or other gardens rather than lingering in Shanghai. There is souvenir shopping outside and lots of easy places to grab a quick bite."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "scubadude9",
    "user_loc": "马来西亚吉隆坡",
    "bubble": "50",
    "add_time": "2011年10月4日",
    "title": "Souvenir Shopping place in Shanghai",
    "content": "My wife and myself just love this place, we went there twice to do our souvenir shopping, the city god temple is worth the visit, it charges a few RMB to go inside. Try to walk 'around' the Yu garden, there are plenty shops to see in the outer circumference of the place, with small shops selling very nice t-shirts, RMB$5 shops, eateries, bags etc. Tried twice to que up at the famous dumpling shop but its just too long to wait, so we skipped it and eat somewhere else. Its quite easy to hail a cab right outside the Yu garden or within walking distance to the subway. TOURIST BEWARE : Keep your belongings close to you and be alert."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "TheTraveler888",
    "bubble": "50",
    "add_time": "2011年11月4日",
    "title": "Shop & Eat",
    "content": "Find just about anything you want as a souvenir from China. Great for pearls and silk because of some specialty stores. Numerous food courts and food stands."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "to_calvary",
    "bubble": "40",
    "add_time": "2011年11月4日",
    "title": "Garden is so so, wholesale shopping was excellent",
    "content": "We didn't visit Yu Yuan for the garden itself. There are many small eateries and lots of shops selling great varieties of local products and souvenirs at touristy prices. If you want to buy local good quality tea to try or as gifts, this is a good place to get it. The jasmine tea (those big dried flowers that are individually wrapped and open up / \"blossom\" when you steep in hot water) is very fragrant and suitable as gifts. To me, the greatest attraction was the wholesale \"shopping centres\" (more like buildings as they are quite run down) behind Yu Yuan offer great shopping for adults and kids alike. Lots of stationery and good quality toys at relatively low prices (eg remote control cars, remote control helicopters and planes, stuff toys) and apparel (undergarments, socks, scarves, hats) and items suitable as gifts (eg towels, decorative items). Even the kids (aged 4 and 8) had great fun shopping! I visited this place a 2nd time without the kids to shop till I dropped!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "KimmieRN",
    "bubble": "30",
    "add_time": "2011年11月3日",
    "title": "Not impressed by this garden",
    "content": "I was not impressed by the YuYuan Gardens. First of all, it is not free to enter the garden. I thought I paid about 20RMB for entry but looking at my ticket stub, I think I paid 40RMB to enter the gardens. It's not worth the money. The garden was kinda dirty and not very well kept. It just didn't feel very genuine. The only part of the park I liked is the pond with the koi fish and gazebo."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Howdidoo",
    "bubble": "30",
    "add_time": "2011年11月1日",
    "title": "Overhyped",
    "content": "Its a really unique place, not quite a garden coz no flowers.. but very different style with tea houses and typical Ming dynasty structures."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "linzerhi",
    "bubble": "50",
    "add_time": "2011年11月1日",
    "title": "Beautiful Gardens",
    "content": "The Yu Yuan is a hidden gem of Shanghai. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "bastani",
    "user_loc": "加拿大多伦多",
    "bubble": "50",
    "add_time": "2011年10月30日",
    "title": "great walk and structures",
    "content": "awesome must visit old Chinese style garden... could spend a couple of hours seeing the park and relaxing in there. only bad thing was the big tour groups that walked through the park and were inconsiderate and loud!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AnnaD66",
    "user_loc": "英国斯特劳德",
    "bubble": "30",
    "add_time": "2011年10月26日",
    "title": "Disappointing",
    "content": "If you are on a tight time schedule, don't bother.  Seen one garden you've seen them all in my opinion."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "PeteD_London",
    "bubble": "50",
    "add_time": "2011年10月24日",
    "title": "Lovely",
    "content": "Go very early or very late in the day to avoid the crowds"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "brownbear250",
    "user_loc": "英国Castle Cary",
    "bubble": "20",
    "add_time": "2011年11月14日",
    "title": "So crowded.",
    "content": "I really felt that the whole point of this garden was lost due to over crowding.I know I contributed to this,but it would have been nice if there had been some sort of timed ticket arrangement. It was an absolute procession, Shopping nearby was great if a bit touristy"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "JimOB1",
    "user_loc": "堪萨斯奥拉西",
    "bubble": "50",
    "add_time": "2011年11月14日",
    "title": "peaceful and interesting",
    "content": "Well worth and afternoon. Lots of people, but the tea room was very interesting."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "MarcD766",
    "user_loc": "比利时安特卫普",
    "bubble": "50",
    "add_time": "2011年11月12日",
    "title": "nice garden in the old town",
    "content": "certainly worth a visit\ngreat contrast with the 'modern' shanghai\ngo in the morning when not too crowded"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "FrankJSanDiego",
    "bubble": "40",
    "add_time": "2011年11月29日",
    "title": "Relaxing Setting",
    "content": "Picturesque structures of the old culture with modern skyscrapers on the horizon.  Well worth visiting."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "CDN-Traveller1961",
    "user_loc": "加拿大埃德蒙顿",
    "bubble": "40",
    "add_time": "2011年11月12日",
    "title": "Really nice garden!",
    "content": "We enjoyed the garden even though the heat was stiffling!!!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "fongie84",
    "bubble": "40",
    "add_time": "2011年11月11日",
    "title": "Busy Busy Busy",
    "content": "We never did pay and go into the Garden, but we walked around the area enough to get a feel of it. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "arno1",
    "user_loc": "夏威夷希洛",
    "bubble": "50",
    "add_time": "2011年11月11日",
    "title": "Great Garden but we wre templed out...",
    "content": "This was a very interesting garden with a long history and has an amazing collection of Carp....."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "jchu88888",
    "bubble": "30",
    "add_time": "2011年11月8日",
    "title": "very crowed",
    "content": "Historical builings. BUT very crowded. Watch out for rubbers."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "CharlotteU",
    "user_loc": "英国布里斯托尔",
    "bubble": "40",
    "add_time": "2011年11月7日",
    "title": "Nice to see a bit of traditional China",
    "content": "Yu Yuan Garden is lovely to walk around, it is picturesque and there are lots of little stalls to look at and buy souveneirs. I recommend a walk here before finding somewhere to eat on Nanjing Road, try 'Charme' a restaurant within one of the shopping malls on Nanjing Road."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "art_philip",
    "user_loc": "香港",
    "bubble": "40",
    "add_time": "2011年11月29日",
    "title": "Fine place to linger around",
    "content": "Well.... more commercial than historical. Yet worth a walk to try the local snacks."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "HappyTraveller658",
    "user_loc": "加利福尼亚奥克兰",
    "bubble": "50",
    "add_time": "2011年11月28日",
    "title": "Shanghai history and beauty",
    "content": "The Garden is nestled into the Old Market area and is an oasis of classical Chinese garden beauty. Even visiting in November it was crowded, but mostly with Chinese tourists. I enjoyed the contrast of the classical gardens old pavilions and the tops of skyscrapers you can see over their roofs. The Old Market area is also worth a visit (and you can't avoid it if you come to the Garden) but be sure to bargain and avoid the people who approach you on the street trying to sell watches and purses."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Martin_1971",
    "user_loc": "荷兰Oldenzaal",
    "bubble": "30",
    "add_time": "2011年11月24日",
    "title": "Verry touristy...",
    "content": "Not much to see, lots of shops, lots of people, and not so much garden. One big touristy happening."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "JDLexington",
    "bubble": "50",
    "add_time": "2011年11月19日",
    "title": "Visit on a drizzly day, if you can--but do visit",
    "content": "This is a gorgeous, intimate, and subtle oasis within the boisterous, booming (but often, also, gorgeous) city of Shanghai. Not enormous, but enough twists and turns and surprises around corners to feel much bigger than it is. No doubt there are levels of meaning only accessible to those who (unlike me) are expert in Chinese history, culture, or art. But even for the uninitiated it's a special place. The downside: Lots of people feel the same way, and it tends to be packed. My teenage daughter who took me there--she's spending a gap year in Shanghai--says the trick is to go on a drizzly day. Much of the garden is sheltered enough by trees, buildings, or rock formations to stay fairly dry unless it's pouring. But tourists don't know this, and since it's technically \"outside\" tend to stay away when there's a little rain. If your only option is a sunny day, expect crowds--but go anyway."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "EfficientTraveler",
    "user_loc": "路易斯安那州巴吞鲁日",
    "bubble": "50",
    "add_time": "2011年11月18日",
    "title": "Great views and great shopping",
    "content": "Lots of photo-ops at the Garden, and the shopping outside had a ton of stuff to choose from. Prices were very reasonable, but generally non-negotiable. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "128sharlenet",
    "user_loc": "加利福尼亚圣地亚哥",
    "bubble": "40",
    "add_time": "2011年11月6日",
    "title": "Magical Garden",
    "content": "This classical Chinese Garden is very special, but reached only by working your way through the disneyland of china, full of hustlers hawking overpriced souvenirs and fake watches. Do not go on the weekend when 1million of Shanghai's 20 million people will be there too!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "VinceVW",
    "bubble": "40",
    "add_time": "2011年12月28日",
    "title": "Nice garden with many shops and resturants",
    "content": "Visted this place and there are many shops selling local chinese tea, souveniers as well as resturants selling Shanghai Xia Long Bau (Small meat dumpling)"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AmanitoG",
    "user_loc": "荷兰阿姆斯特丹",
    "bubble": "50",
    "add_time": "2011年11月16日",
    "title": "Garden of 'Shopping' Contentment",
    "content": "Ah what to say about Yu Yuan Garden ... it's a paradise for bargain hunters. Definitely the best place in Shanghai to come to get a bargain in watchy-bags, scarves and Chinese souvenirs (beware fake silk is rife here - ask to do the burning test i.e. burn a loose thread and if it smells like hair and the ash is black it's real - if it smells like paper/plastic or continues burning (when blown out) or melts then it's fake. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Shandawanda",
    "user_loc": "菲律宾马尼拉",
    "bubble": "50",
    "add_time": "2011年11月16日",
    "title": "Surprisingly tranquil despite the bazaars outside",
    "content": "What I appreciate about this garden is its authenticity as a Chinese garden -- and it is well preserved too. You will still find pockets of tranquil spots despite the numerous tourists visiting the place day by day. When you visit this garden, take note of the details: its artistic archways, intricate windows and panels, carvings in the roof, bonsai trees bigger than you, and rock gardens perfect for photo shoots."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Crazytine",
    "user_loc": "加拿大万锦市",
    "bubble": "50",
    "add_time": "2011年11月16日",
    "title": "Beautiful place reflecting chinese ancient buildings",
    "content": "It took us some time to find the place since the entrance is pretty hidden. You have to go through a shopping area first and entrance in one of the alley ways of the shopping area. We went first thing in the morning so it was empty and not crowded or anything. I couldn't not believe that someone would build such a great \"cottage\" complex for his parents. It is hard to see original chinese style homes in Shanghai and outskirts but you could see it here with great ponds and gardens. Definitely you should check out Yu Garden if you are in Shanghai. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Vivacat12",
    "user_loc": "英国巴斯",
    "bubble": "50",
    "add_time": "2012年1月7日",
    "title": "Fantastic",
    "content": "These gardens are amazing and very cheap to visit approx £3. There are very large and surrounded by lovely buildings and the bazaar."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Geerlings",
    "bubble": "40",
    "add_time": "2011年12月8日",
    "title": "Beautiful old Chinese garden",
    "content": "It was a bit busy in the weekend but well worth a visit. The garden is surrounded by a shopping center where you can eat and shop (for souveniers)"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Tufty59",
    "bubble": "50",
    "add_time": "2011年12月6日",
    "title": "China at its best",
    "content": "Layout excellent and the buildings magnificent. Wonderful to see the history of China."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "thetravelbear12982",
    "user_loc": "伊利诺伊州芝加哥",
    "bubble": "50",
    "add_time": "2011年12月5日",
    "title": "Definitely worth the entrance fee",
    "content": "I absolutely loved the Yu Gardens! The architecture is beautiful. You could easily spend an entire day in the grounds...I'd suggest bringing a picnic lunch or snacks, taking a seat and just enjoying the grounds on a sunny day. The old town surrounding the gardens is also a must! "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Artemus_Gordon",
    "bubble": "50",
    "add_time": "2011年12月5日",
    "title": "Best place to visit in Shanghai",
    "content": "A whole lot going on here at Yu Gardens. Great market, beautiful buildings, architecture, scenery, culture, tradition, history, and a real feel for the city. This is where to go if you only visit one place. Great souvenirs and reasonably priced...but haggle. Only caution is watch out for pickpockets."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Alex_Glant",
    "bubble": "40",
    "add_time": "2011年12月2日",
    "title": "Nice to watch",
    "content": "Liked to walk around and relax there. It is also easy reachable with the public transportations."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "jacrye",
    "user_loc": "加拿大巴利",
    "bubble": "40",
    "add_time": "2012年1月23日",
    "title": "Peaceful",
    "content": "Nice place to spend a couple of hours, not a lot to see"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "maryjoe0777",
    "user_loc": "纽约州长岛",
    "bubble": "50",
    "add_time": "2011年12月2日",
    "title": "bargin hard",
    "content": "It is lots of fun looking at tons of merchandise( all kinds). but remember bargin hard to get the best price."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "gull70",
    "user_loc": "佛罗里达莱克兰",
    "bubble": "50",
    "add_time": "2011年12月2日",
    "title": "Ok, so it's a bit of a tourist trap",
    "content": "but one just can't dislike it. Yes, there are a lot of hawkers and everyone is trying to sell you something but you still have to enjoy the atmosphere. It's a bit of the old China you used to see in the movies, how could you pass it up."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "LaraA344",
    "user_loc": "印第安那Edinburgh",
    "bubble": "30",
    "add_time": "2011年12月1日",
    "title": "must-see",
    "content": "Great to see, though the area is crowded and (naturally) full of people trying to rip you off. That said, there are bargains to be had, especially in the pearl market. Try Angel's booth on the third floor. The garden itself is lovely and the area around it is an interesting mix of authenticity and touristy tat. Good food available at the Chinese-style cafeteria."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Nala1111",
    "user_loc": "上海市",
    "bubble": "40",
    "add_time": "2011年11月30日",
    "title": "A must visit",
    "content": "The garden is beautiful well preserve, a government oficcial built it for his parents almost 500 years ago, outside the garden you can find the oldest street in Shanghai Banfang road, cute souvenirs shops and a flavour of real china. Prepare to bargain though."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "OliviaBrazil",
    "user_loc": "巴西维多利亚",
    "bubble": "50",
    "add_time": "2012年1月31日",
    "title": "Amazing and \"very chinese\"...",
    "content": "A very nice place to visit, the Yu Yuan garden reflects much of Chinese culture. There are 4 elements for a chinese garden: rock, flower, tree and water. In perfect harmony, the garden offers the visitors a relaxing and beautiful place to spend some time. Allow 1 hour for your visit, so that you may enjoy the atmosphere. It´s amazing how you find such a peaceful place in the middle of all the noise and rush of Shangai. Don´t miss it. Around the garden there are lots of shops and vendors where you may buy souvenirs."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "KP-Shanghai",
    "bubble": "40",
    "add_time": "2012年2月14日",
    "title": "Nice garden!",
    "content": "A lot of decorations around the Chinese New Year makes a visit well worth doing. And dont miss the QLBs. The garden is pretty and has nice views."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "ordisw",
    "user_loc": "明尼苏达圣保罗",
    "bubble": "40",
    "add_time": "2011年12月27日",
    "title": "Retreat",
    "content": "An interesting retreat with in the Old City. With the hectic pace of the area; read: tourists, it was nice to slip in and enjoy a bit of history. Self-guided, you can linger or speed through. It was so pleasant to sit quietly for awhile, before joining the rest of the masses in the streets."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "11freddie",
    "user_loc": "新西兰基督城",
    "bubble": "40",
    "add_time": "2011年12月26日",
    "title": "Scenic Gardens",
    "content": "Very beautiful, the new and the old mixed is amazing. Try and find the tea and opera house nearby one the cities better views"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "al7jj",
    "user_loc": "俄勒冈波特兰",
    "bubble": "40",
    "add_time": "2011年12月24日",
    "title": "Best traditional garden in Shanghai",
    "content": "This is certainly the best traditional garden in Shanghai, and is right by a metro stop. It gets really crowded, so it is best to go right around opening time. The shops in the area around it are mostly tourist traps, although there are some good restaurants and food courts."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "timothyseanfang",
    "bubble": "30",
    "add_time": "2011年12月23日",
    "title": "Over-commercialised and too crowded",
    "content": "The heritage of the place is good to see, and looking at old-style Chinese houses and architecture is interesting. However, the place surrounding Yuyuan Garden is too over-commercialised and crowded; all of the surrounding buildings have been turned into restaurants, shops; there is even a Starbucks outlet facing the site. It's a good place to visit if you like the atmosphere and all with shops selling all kinds of curios and things, but in general I think the commercialisation of the place undermines its value. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "viCzinity",
    "user_loc": "印度尼西亚雅加达",
    "bubble": "30",
    "add_time": "2011年12月22日",
    "title": "Piece of past beauty",
    "content": "This garden is located in the middle of Shanghai city. Before entering the gate, you will find many shops selling various goods from fresh cooked food, snacks, souvenirs, fabric etc. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "DaliCT",
    "user_loc": "新加坡新加坡",
    "bubble": "30",
    "add_time": "2011年12月18日",
    "title": "Nice Garden, but crowded",
    "content": "It is a nice garden to visit for a a few hours (maybe 2 hours is enough). It is rather huge, so get a free map at the entrance to get you around. Very good place for for nice photo shoots. The garden can get a little crowded during weekends."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Kieran11",
    "user_loc": "马来西亚吉隆坡",
    "bubble": "50",
    "add_time": "2011年12月15日",
    "title": "A step back in time",
    "content": "we actually found this place by accident - but like many accidental discoveries it turned out to be a charming break from the madness outside - dating back around 300 years it represents a whole slice of history at that time. The admission was only 30 Yuan per person so its hardly gonna tax the pocket and is easily worth a couple of hours to enjoy the architecture as well as the gardens themselves.......... errrrr peace and tranqulity you probably wont find however - its China ! "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "TripAdvisor会员",
    "user_loc": "澳大利亚墨尔本",
    "bubble": "30",
    "add_time": "2012年1月7日",
    "title": "A garden were there is morerubbish in the ponds than in the bins",
    "content": "What a bloody discgrace. With all the poor people unemployed and labour so cheap one would expect a few plants that were not dead. A few people doing tai Chi is certainly not CONTENTMENT but an escape from the daily grime these poor folk must endure"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "pari-no-batta",
    "bubble": "50",
    "add_time": "2012年1月7日",
    "title": "Wonderful sanctuary in the middle of Shanghai",
    "content": "The entrance is a bit pricey (maybe 90 RMB?) but worth it. It's a like a labyrinth and every new scene you stumble onto is gorgeous."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Darulnur",
    "bubble": "40",
    "add_time": "2012年1月5日",
    "title": "Nice private garden",
    "content": "There are always many people outside Yu Yuan Garden as there are many shops, restaurants, tea house, temple, etc. There is a nice lake near the garden. Buy a ticket (30 yuan) to enter the Yu Yuan garden. It is worth it as the garden is a nice private garden."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Jennifire",
    "user_loc": "英国Worcestershire",
    "bubble": "40",
    "add_time": "2011年12月13日",
    "title": "Needs more than one visit",
    "content": "This little oasis of peace in the madness that is Shanghai Old Town is worth coming back to. I've now been 4 times, and each time find something new to see or learn. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "SimS304",
    "user_loc": "上海市",
    "bubble": "40",
    "add_time": "2012年1月5日",
    "title": "Nice oasis in the city",
    "content": "Good for slow walking and enjoying the good fengshui"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AnnaNowi",
    "user_loc": "波兰华沙",
    "bubble": "50",
    "add_time": "2012年1月3日",
    "title": "Place to escape from noise",
    "content": "When you find Old Shanghai with beautiful traditional architecture you need to look for Yo Yuan Garden (entrance fee). Within a green park with blooming trees, little lake I have found so many nice motives for photos of typical architecture and decor elements! I did not like to leave it... A visit warmly recommended!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "MrMink",
    "user_loc": "澳大利亚悉尼",
    "bubble": "30",
    "add_time": "2012年1月2日",
    "title": "maybe if you like Chinese gardens...",
    "content": "decided I am not that into classical Chinese gardens as also visited Nanjing and Suzhou - this one is a bit claustrophobic, not to mention difficult to find the entrance to in Old Town as little signposting"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Peter_Heisenberg",
    "user_loc": "丹麦欧胡斯",
    "bubble": "50",
    "add_time": "2011年12月30日",
    "title": "Fantastic place - also in the evening",
    "content": "At night you cannot enter the garden, but it still nice to see the surroundings with beautiful lights."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Ana-Pete",
    "bubble": "50",
    "add_time": "2011年12月29日",
    "title": "Typical Chinese",
    "content": "When you go in Yu Yuan in Shanghai, you leave the normal world and step in a classical Chinese one. The pavilions, ponds and gardens take you to a different and wonderful time, which is beautiful to watch and stroll through. Really a joy for visitors"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Menna29",
    "user_loc": "埃及开罗",
    "bubble": "50",
    "add_time": "2012年1月22日",
    "title": "Amazing place",
    "content": "Very beautiful and peaceful place in the middle of Shanghai"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "juliemas",
    "user_loc": "澳大利亚悉尼",
    "bubble": "50",
    "add_time": "2011年12月29日",
    "title": "Beautiful place to spend time",
    "content": "Yu Yuan garden is located in the city of Gods with all the other shops, restaurants and temple. It is a nice Chinese garden with its character. Spend the time there to see details of the the building, architecture. We did not have a tour guide to explain, if there's a guide it would be more interesting."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "LeBonVoyage58",
    "user_loc": "明尼苏达明尼阿波利斯",
    "bubble": "50",
    "add_time": "2012年1月20日",
    "title": "Beautiful and tranquil",
    "content": "This was a lovely, lovely introduction to Chinese gardens.  Beautiful vistas, lovely layout, a great way to spend an afternoon."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "conceguliane",
    "user_loc": "罗马尼亚康斯坦萨",
    "bubble": "30",
    "add_time": "2012年1月20日",
    "title": "Authentic Chinese \"Bazaar\" (partially)",
    "content": "My experience in Yu Yuan was exclusively about the crowded shops area. There are many foreigner groups wondering everywhere, and every 10 meters or so you are stopped by the fake stuff sellers (bangs & watches predominantly). Nevertheless, if you plan to have a remarcable souvenir from China or you want to pamper your lady (or if you are a lady to make yourself an exquisite present) Yu Yuan shopping area is the place - for Jade. Here there are many shops selling Jade (true and certified one). True jade is always (very) expensive, reaching to several thousands EUR for a unique pattern, deep green Jade bracelet. For the budget seekers, the little more cheaper white Jade (called \"Mutton Fat\") is as well available at rather hundreds EUR per bracelet. Furthermore the area is filled with Tea Shops, Chinese Medicinal Herbs Farmacies, etc. Give it a try!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "JuhnsTraveler",
    "user_loc": "乔治亚亚特兰大",
    "bubble": "50",
    "add_time": "2012年1月16日",
    "title": "Best place in Shanghai, don't miss",
    "content": "We just loved this place out of all places we went in Shanghai. Good place for shopping (traditional stuff), best restaurants (best juice dim sum in Shanghai) and 400 years old architectures. Don't need to go inside Yu Yuan's Garden (35 Yuan per person) just stay in surrounding area."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Likeitniceandclean",
    "user_loc": "俄亥俄",
    "bubble": "30",
    "add_time": "2012年1月15日",
    "title": "Worth a visit",
    "content": "It is worth a visit. The garden is quite pretty. When we visited it was extremely crowded but most places in China are."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "kissane",
    "user_loc": "澳大利亚珀斯",
    "bubble": "40",
    "add_time": "2012年1月31日",
    "title": "Lanterns and decorations!",
    "content": "We arrived at Chinese New Year, so were lucky to see quite extraordinary and wildly colourful decorations for the forthcoming event, in the vicinity of the gardens. Gardens themselves are nice, but Suzhou is much nicer. Lots of tourist shopping around here: bargain fiercely. Certainly worth a visit. Some nice Shanghainese restaurants in the shopping centre opposite the bazaar (top floor)"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Oleksandra068",
    "user_loc": "乌克兰敖德萨",
    "bubble": "40",
    "add_time": "2012年1月30日",
    "title": "We love it!",
    "content": "We thought this place is used to film a lot of Chinese series and movie. It was a very pleasant trip to get out of the busy city life and linger around this garden. Outside the place, you can find several street vendors for snacks, food, souvenirs. However they speak almost no English, so carry a guidebook with you all the time!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "JenniferG643",
    "user_loc": "纽约州Elmira",
    "bubble": "40",
    "add_time": "2012年1月30日",
    "title": "Beautiful",
    "content": "Even though we gt there late in the day and most of the exhibitions inside were closed (either due to time or the holiday...Chinese New Year week), we enjoyed the buildings, courtyards, and plants. Be sure to look \"up\". There are an unusual array of statues on the roofs, from warriors to animals. Also, the entire outer wall is suppose to represent a curling dragon body, so look out for it's \"head\". "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "HafiedzAH",
    "user_loc": "马来西亚新山",
    "bubble": "40",
    "add_time": "2012年1月27日",
    "title": "nice chinese architecture",
    "content": "Like: experienced the small alley guided shopping, which led us to a small but packed with stuff room, after a climb on the steep narrow stairs. :D"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "hrgemmsg",
    "user_loc": "新加坡新加坡",
    "bubble": "40",
    "add_time": "2012年1月27日",
    "title": "Interesting",
    "content": "Interesting place to see.  Many shops around selling china made bags, toys, electronic, shoes, etc  You have to bargain though"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "dbdk",
    "user_loc": "西班牙巴塞罗那",
    "bubble": "50",
    "add_time": "2012年1月26日",
    "title": "A must go in Shanghai!",
    "content": "Cool place to explore the typical old houses, with lot of traditional things to buy and see!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "TommoUSA",
    "bubble": "40",
    "add_time": "2012年1月26日",
    "title": "One of the best, easy access gardens in Shanghai",
    "content": "Let's be clear, this is a Chinese Garden so there's no flowers but lots stone mountains, reflecting pools, symbolism and hidden views which are exposed in only one direction. It's nearly 500 years old and is divided into different sections with historical themes, structures and architecture. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Fastphilad",
    "bubble": "50",
    "add_time": "2012年1月25日",
    "title": "Old Shanghai redone but nice",
    "content": "This is how part of Shanghai used to be. Many markets, peddlers tourists but a place for some very nice pictures and to experience the many people of Shanghai and China. It's a tourist area so be careful of your personal belongs. Wallet and purses in front and be diligent of scams. Been there many times and if in doubt, \"Just say NO\""
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Bhavzz",
    "user_loc": "印度孟买",
    "bubble": "40",
    "add_time": "2012年1月25日",
    "title": "Beautiful shopping area",
    "content": "This is a beautiful shopping area. I loved the entire concept of this place...with lake...small narrow colorful streets with shops lined with goodies. In the night, they light up the entire area and it looks beautiful."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "menome",
    "bubble": "50",
    "add_time": "2012年1月11日",
    "title": "Must do",
    "content": "Very traditional garden. right next markets and restaurants."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "poL151",
    "bubble": "50",
    "add_time": "2012年1月9日",
    "title": "shopping for local products",
    "content": "It is a place for local people shopping too. You will find a lot of bargain and famous shanghai made products - harmonica and knife. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "missy88sydney",
    "bubble": "50",
    "add_time": "2012年2月29日",
    "title": "Incredible",
    "content": "I have been going here for many years. In more recent times it has attracted srteet hawkers and mobs of people, however, the original charm is still evident. The dumpling houses and great tea houses are still there, still so popular, and the ancient timber floors eateries are a true relic of the past. The bridges to the temples and the sonderful old buildings are a reminder of what China was a very tone time ago. I highly recommend this area and don't miss the wonderful Shanghainese Dumplings"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "TomasB305",
    "user_loc": "上海市",
    "bubble": "50",
    "add_time": "2012年3月14日",
    "title": "A must see",
    "content": "A must see. Very nice gardens with centuries old architecture. Close neighbourhood is full of small shops (e.g. we did buy some tea there) and eateries."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "wondermnd",
    "user_loc": "纽约州纽约市",
    "bubble": "30",
    "add_time": "2012年2月14日",
    "title": "Crowded as usual",
    "content": "A must see stop for all foreign tourists. Too crowded for my taste. But the temple is a must visit."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "SandraC432",
    "user_loc": "英国贝克斯利希斯",
    "bubble": "50",
    "add_time": "2012年2月13日",
    "title": "A haven of peace",
    "content": "It is beautiful, serene garden although there were no leaves on the trees when we were there. It must be wonderful in the summer."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AvidTravellers56",
    "bubble": "50",
    "add_time": "2012年2月12日",
    "title": "Must do",
    "content": "This is a must do place in central Shanghai, part of the old Shanghai city - every tourist goes here and is a must see"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "MJwanderer82",
    "bubble": "50",
    "add_time": "2012年2月11日",
    "title": "A must see!",
    "content": "One of the most beautiful gardens in the china and the world. It is not a big garden, but it takes you about 2 hours to see all the beauty and of course you can make great photographs."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "ex-globetrottingbabe",
    "user_loc": "科罗拉多戈尔登",
    "bubble": "40",
    "add_time": "2012年2月8日",
    "title": "A must do in Shanghai",
    "content": "It's in the old town Shanghai where they've preserved shops so you can have a feel of what it was before. It's a nice walk where you can see gardens, pavilions and rockeries. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Benanza",
    "user_loc": "上海市",
    "bubble": "50",
    "add_time": "2012年2月6日",
    "title": "Great old city",
    "content": "I live and work in Shanghai. The dumplings here are worth waiting in line for. We always take guests here. Great place to buy traditional Chinese print kids' clothes and a Starbucks coffee! You can eat at the restaurant where Bill & Hillary dined in the center of the garden. Good place to buy pearls!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "aussieinhangzhou",
    "bubble": "20",
    "add_time": "2012年2月5日",
    "title": "Too commercial",
    "content": "Was disappointed, was told it was the old street, was just a bunch of shops selling a lot of rubbish, not worth seeing. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Sungron",
    "bubble": "10",
    "add_time": "2012年2月5日",
    "title": "Don't bother",
    "content": "No different than many similar places in Korea and Japan, except for having to elbow through mobs in the garden and God knows how many street vendors just outside. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "alexanderCokeS",
    "bubble": "50",
    "add_time": "2012年2月4日",
    "title": "One of the Only Authentic Historical Sites Left in Shanghai",
    "content": "This garden is absolutely spectacular. If you can arrange to arrive late on a drizzly afternoon, you will be treated to a sublime Chinese garden experience. That is - avoid the crowds at all costs!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "jbzfarm",
    "bubble": "40",
    "add_time": "2012年3月28日",
    "title": "Worth the visit - wish I had more time",
    "content": "Some wonderful shops and restaurants to occupy a good half a day. Certainly worth seeing and a pleasant area. Do keep your wallet close and don't get too annoyed with the many watch salesmen."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "jpicon",
    "user_loc": "上海市",
    "bubble": "50",
    "add_time": "2012年4月6日",
    "title": "Beautiful garden",
    "content": "Great history and a beautiful garden to see in Shanghai."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "cardiacwiz",
    "user_loc": "内华达拉斯维加斯",
    "bubble": "50",
    "add_time": "2012年4月17日",
    "title": "Place of peace in the midst of bustle...",
    "content": "Serenity in an ancient Chinese garden and villa complex, off the beaten path...offering peace, beauty, and a harking back to simpler times..."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "G7050UUjoset",
    "user_loc": "新加坡新加坡",
    "bubble": "40",
    "add_time": "2012年2月27日",
    "title": "Nice place to visit in Shanghai",
    "content": "It is definitely a tourist trap...but most people reading this will likely be a tourist anyway. It is easy enough to get to. You can take a train or simply walk from the Bund to here. The entrance fee is very cheap. There are a lot of souvenir and gift shops located around the area as well. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Peter_S_1963",
    "user_loc": "马萨诸塞波士顿",
    "bubble": "50",
    "add_time": "2012年2月25日",
    "title": "Yu Yuan Garden",
    "content": "At first, it appears to be only a collection of unique buildings with shops and a water feature. Spend the time and go into the historical garden - the entrance can be tough to find but provides some tranquility in the busy city (at least in the morning). Also, make sure you try the Nanjing Dumpling Shop - well worth waiting in the line!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "imah-man",
    "user_loc": "马来西亚吉隆坡",
    "bubble": "40",
    "add_time": "2012年2月25日",
    "title": "Very fantastic and nice view of the garden",
    "content": "The garden is very beautiful and more beautiful if we visit when spring time. The garden also clean and we encourage visiter to visit when not public holidays falls for the local as that time many visitors"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "kaycomo",
    "bubble": "40",
    "add_time": "2012年2月22日",
    "title": "Almost Chinese New Year",
    "content": " The Gardens, seen in winter were bare but still interesting. Such a lot of work to achieve the result. The differnt 'doorways to the gardens' very different and the stone work on the paths, such an amazing work from a clever designer. Very well worth a visit. Decorations being put up for the New Year, the garden would have looked splendid during that time."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "mishous",
    "user_loc": "澳大利亚墨尔本",
    "bubble": "40",
    "add_time": "2012年3月14日",
    "title": "Be Early",
    "content": "Another great place to visit but I recommend you go early as it's gets very busy. It also backs on to the 'Old Shanghai' so you don't have far to walk if you want to want to walk across the Zig Zag bridge for luck or visit a Tea house. This place closed early too so don't leave it till the last part of the day to do. The 1st time I went I did the Pearl Tower then ventured there.....bad move as it was closed. Most things in Shanghai are open very late, so make this a 1st thing for the day trip!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "PRLSPPOANY",
    "user_loc": "纽约州纽约市",
    "bubble": "40",
    "add_time": "2012年3月13日",
    "title": "nice",
    "content": "Yu Yuan it's really crowded outside, but inside is ok. Don't waste your time outside."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "aajarvis",
    "user_loc": "特拉华州New Castle",
    "bubble": "50",
    "add_time": "2012年3月12日",
    "title": "Do not miss this pleasant little corner in Shanghai",
    "content": "You have to go SOMEWHERE in Shanghai to shop for trinkets, so choose the Yuyuan bazaar. Way in the back is the entrance to this historic site, well worth finding. For about $5 US, you can find a comfortable place to sit and sort through the loot, watch people, and learn what a Chinese garden is. Don't expect big expanses of green, even in 1500 space was valuable, and don't expect quiet anywhere in Shanghai. But who knew koi could top 50 lb! Bring a few crackers. There are shops in many of the historic buildings that have the highest quality art and craft pieces I have seen for sale anywhere in China. If you have $50,000 to spend on an amazing jade dragon or an 8 layer puzzle ball, shop here. If not, enjoy the show."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "af01",
    "user_loc": "丹麦哥本哈根",
    "bubble": "40",
    "add_time": "2012年3月11日",
    "title": "Scenic garden!",
    "content": "Visited Shanghai in March, so the garden was still not very colourful. But even though this, it was a great walk through the various sections of the beautiful garden."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Traveler10Chicago",
    "bubble": "50",
    "add_time": "2012年2月21日",
    "title": "Worth seeing when in Shanghai",
    "content": "With Shanghai being such a modern metropolis, sometimes it feels devoid of the ancient China that a visitor might expect. Just a stone's throw from the Bund and easily accessible by Metro, the Yu Yuan Garden provides that look and feel of ancient China, with old achitecture, a tea room, rows of Chinese crafts and shops, the garden/rock area and zigzag bridge pond at the center."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "mandythebirdlady",
    "bubble": "50",
    "add_time": "2012年2月17日",
    "title": "Peace amongst chaos",
    "content": "This is truly amazing if you manage to visit during a quiet soell. The old buildings and wonderful gardens transport you to a bygone age. Definitely worth a visit. Nice to find a gnarled tree root and sit and watch the world go by. Excellent."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "TimY859",
    "user_loc": "内华达里诺",
    "bubble": "40",
    "add_time": "2012年2月17日",
    "title": "History of Shanghai",
    "content": "These buildings are some 400 plus years old, so the value is the age itself. The tour is self guided, with not much explanation. I guess you should read up on pre-colonial Chinese history to understand the buildings and who would have been living in them. I'm sure that guide services are available, but I have no information as to the quality; only that I saw a few guides escorting private parties."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Chi1976",
    "bubble": "50",
    "add_time": "2012年2月15日",
    "title": "open space in the capital",
    "content": "This place you can relax away from the large crowds and also see the government building close by."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "derekh57",
    "user_loc": "英国伦敦",
    "bubble": "40",
    "add_time": "2012年3月9日",
    "title": "Lantern festival madness",
    "content": "Probably the most touristy part of Shanghai but after many visits we never tire of the area. Visited during the Chinese New Year just before the lantern festival. Beautiful and fun dragon theme but mentally busy thousands of people pushing and shoving their way around the water features. A visit to the huge canteen style restaurants is a must, 100's of dishes individually cooked by dozens of chefs, 1000+ covers but try and get a table at lunchtime - madness."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "OldJalopy",
    "bubble": "30",
    "add_time": "2012年3月7日",
    "title": "Nice spot, but unnecessary if you've been elsewhere in China",
    "content": "It is in and of itself quite a lovely little haven away from the modern city which surrounds it."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "cgasbarro",
    "bubble": "40",
    "add_time": "2012年3月4日",
    "title": "Terrific experience",
    "content": "had a great tour and enjoyed my time here. A little cold when we visited in February, would like to come back when in more vibrant color"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "fatshaman",
    "user_loc": "新加坡新加坡",
    "bubble": "30",
    "add_time": "2012年3月3日",
    "title": "Hufe crowds",
    "content": "The garden itself was not too crowded. Maybe one has to pay to go in so not many tourist did even though it wasn't expensive. Gardens were ok..nothing spectacular. Lotsa shops and eateries outside the gardens"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "8Aussietravellers8",
    "user_loc": "澳大利亚墨尔本",
    "bubble": "50",
    "add_time": "2012年3月26日",
    "title": "Heavan in Shanghai",
    "content": "If i ever moved from Australia i would like to buy Yu Garden, a home from the Quinn and Ming dynasty with an impossible amount of history to try and cover here - if you travel to Shanghai ensure you come here!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "IsleofWightPoshbird",
    "bubble": "40",
    "add_time": "2012年3月25日",
    "title": "Crowded but lovely garden and story of a sons love for his parents",
    "content": "Really enjoyed the garden, although very crowded on a Saturday in March. Glad we had a guide who could tell the story of Mr pan and his parents"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Melissa_Cornelius",
    "bubble": "50",
    "add_time": "2012年3月25日",
    "title": "best visited in spring",
    "content": "the garden itself is huge.theres also lotsa stuff outside the garden itself.the famous tea house,dim sum restaurant and shopping bazaar are all within a huge area built up like old historical buildings"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "markc78",
    "user_loc": "澳大利亚悉尼",
    "bubble": "40",
    "add_time": "2012年3月23日",
    "title": "Surprisingly nice gardens",
    "content": "After paying the nominal entrance fees (which does keep alot of the locals out), this garden is presented in a well maintained and clean environment."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "CarlThelin",
    "bubble": "40",
    "add_time": "2012年3月20日",
    "title": "Find Peace among the crowds",
    "content": "Incredibly overrun with tourists though it is, the grounds are extensive enough that you can still find peaceful, private courtyards of real beauty."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "WBastiaan",
    "bubble": "40",
    "add_time": "2012年3月20日",
    "title": "A MUST-See when visiting Shanghai",
    "content": "A visit to Shanghai is not complete without a visit to Yu Yuan Garden. Go there early morning, preferably right after the opening, which means it is less crowded. Stroll around and enjoy the scenery. Look back too, as the view does change."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Busytraveler20",
    "user_loc": "德克萨斯州卡罗尔顿",
    "bubble": "30",
    "add_time": "2012年3月19日",
    "title": "Small but okay",
    "content": "It was just okay. The only blooming plants were a few potted plants- ginko bilobas. I wouldn't have spent time there had I known before hand what to expect. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Travelerfirsttime",
    "user_loc": "澳大利亚墨尔本",
    "bubble": "40",
    "add_time": "2012年3月18日",
    "title": "Amazing ancient garden but beware of the scamers at Yuyuan Garden train station!",
    "content": "The Yu Garden is well worth the 30RMB ($5) entrance fee as it’s amazingly beautiful! But it is very crowed and best to go late in the afternoon. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "jourykim",
    "bubble": "40",
    "add_time": "2012年3月17日",
    "title": "Another heritage site !",
    "content": "Nice to visit and feel the traditional and imperial times of China. Well maintain, clean and calm."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "wallflower69",
    "user_loc": "荷兰奥特洛",
    "bubble": "30",
    "add_time": "2012年4月24日",
    "title": "Filled with domestic and local tourists...",
    "content": "Too crowded, I went in and came out shortly... I preferred the shops that are along the roads (nearby at Shanghai Old Street), rather than those inside the oriental-looking Yuyuan building. I didn't see the tranquil garden part but I guess it's deep inside the oriental building.. but there were too many people and shops were selling almost the same stuff so I didn't venture in deeper. But there are many food outlets, shops selling all kinds of souvenirs, and even a Starbucks here. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Adventuresdxb",
    "bubble": "40",
    "add_time": "2012年4月6日",
    "title": "Beautiful, autentic China",
    "content": "Great, but dont go there in the weekends, public holidays. Too crowded. Beautiful view"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "PhoenisSunDog",
    "user_loc": "密歇根Chesterfield",
    "bubble": "50",
    "add_time": "2012年4月2日",
    "title": "Gardens are beautiful, shopping even better",
    "content": "Very pretty quaint gardens. The best part to this area is the shopping. I have never seen anything like this in all of China. greqat deals but crowded."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Patricia032",
    "bubble": "50",
    "add_time": "2012年4月2日",
    "title": "Beautifull gardens",
    "content": "Huge gardens with koi ponds. Very peacefull, lots of visitors but very relaxing"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "greatlake30",
    "user_loc": "爱尔兰都柏林",
    "bubble": "50",
    "add_time": "2012年4月2日",
    "title": "INCREDIBLE",
    "content": "This was absolutely the highlight of my trip to Shanghai. It is the most beautiful garden in the heart of the city. It was previously a private garden (which still blows my mind) and was donated to the government. If I had the time, I would have even gone back for a second visit. In my opinion, it should not be missed."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "alisonc982",
    "user_loc": "英国布拉克内尔",
    "bubble": "40",
    "add_time": "2012年3月31日",
    "title": "lovely Chinese garden",
    "content": "Great place to get some nice photos. Nice to see locals chilling out in there also. it covers quite a large area and there are secret walkways to find so take your time. Nice collection of Koi Carp. It wasnt overly busy on the weekday we went"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AntLomb",
    "bubble": "40",
    "add_time": "2012年3月31日",
    "title": "A must seen in Shanghai",
    "content": "Was there a couple of times, its surely one of the must seen place in Shanghai, a beautifull garden just in the middle of the old town. Bridges, pathways, typical buildings. Expect a lot of people during sunday and saturday, go there early. When you finish the visit you could dive into the old town for some shopping. That's surely an experience. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "faeriehazel",
    "user_loc": "韩国首尔",
    "bubble": "40",
    "add_time": "2012年4月16日",
    "title": "insane but worth a visit",
    "content": "The gardens are charming - a maze of rocks and ponds and pavilions - but if you go on a weekend you won't be able to take a picture without someone getting in the way. And the surrounding area is just one huge tourist trap. Go really early in the morning, on a weekday if possible."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "lolitar",
    "user_loc": "立陶宛克莱佩达",
    "bubble": "50",
    "add_time": "2012年4月15日",
    "title": "cosy garden",
    "content": "We liked this nice cosy garden with few houses, arts, lot trees. Wish to stay longer or even to live... Better to go in the summer or autumn all flowers would be nicer."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "portland27",
    "bubble": "40",
    "add_time": "2012年4月15日",
    "title": "A World Heritage Garden",
    "content": "As an example of Chinese Culture and garden design its an interesting way to spend two hours. You need a guide or guide book else its just a gathering of buildings and lakes. Outside is where all the action is - in te hmarkets. Check out the old style Chinese peep show. Dont use credit cardsfor urchases here. - some place skim them. The Dumplings are however, to die for."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "TJR310",
    "bubble": "50",
    "add_time": "2012年5月3日",
    "title": "In a compact area it is a great place",
    "content": "There are Chinese gardens that are more spectacular. The Humble Aministrator's garden in Souzhou comes to mind. But this garden is so compact and despite heavy tourist traffic remains peaceful and beautiful and serene."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "renatofalzoni",
    "user_loc": "巴西圣保罗",
    "bubble": "40",
    "add_time": "2012年3月29日",
    "title": "Garden with pounds.",
    "content": "Nice to get a fell of the old Shanghai. Around you can find nice little shops."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "bettinamielke",
    "bubble": "40",
    "add_time": "2012年3月28日",
    "title": "Nice place",
    "content": "Yu Yuan Garden is a nice place to be next to the hectic shopping area. We went at a Sunday but is wasn't very crowded. Myabe better to go during weekdays."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "theprincessw",
    "user_loc": "新加坡新加坡",
    "bubble": "30",
    "add_time": "2012年4月13日",
    "title": "Fun for tourist",
    "content": "Very busy place, even during morning time in weekdays. Around the garden there are lots of shops. Don't forget to bargain like crazy. Places inside the shops and those on the street sides often offer the same price. So don't be shy to bargain hard even inside the shops. They'll ask for 85rmb for instance, but it'll end up to only 10rmb."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "cc1047",
    "user_loc": "英国伦敦",
    "bubble": "50",
    "add_time": "2012年4月12日",
    "title": "Beautiful garden - a must for anyone visiting Shanghai",
    "content": "Go in the morning on a week day when it is much quieter. Allow 1-2 hours to really explore as it has hidden gems if you find them. The surrounding market stalls in the old town are lots of fun too."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "aloisw8",
    "user_loc": "马耳他斯利马",
    "bubble": "40",
    "add_time": "2012年4月11日",
    "title": "Very crowded but quiet corners can be found",
    "content": "Amidst a crowded shopping area sits the beautiful Yu Yuan Garden...once you have negotiated the busy shopping area and the crowded zig zag bridge you can find some tranquil corners to relax and enjoy these beautiful formal gargens...just explore every nook and cranny and you will have a thoroughly enjoyable and relaxing time here"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AssafW",
    "user_loc": "以色列特拉维夫",
    "bubble": "40",
    "add_time": "2012年4月10日",
    "title": "Peaceful place in the city",
    "content": "If you want a short break from the city hustle you can take 1-2 hours in these beautiful garden."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Freedom3187",
    "user_loc": "澳大利亚墨尔本",
    "bubble": "40",
    "add_time": "2012年5月11日",
    "title": "Better than other gardens in the area",
    "content": "Liked this garden more than the ones we saw on the day tour."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "missriss",
    "user_loc": "澳大利亚悉尼",
    "bubble": "40",
    "add_time": "2012年4月9日",
    "title": "Gorgeous Chinese Garden, avoid weekends",
    "content": "The gardens sit within a busy complex of touristy shops and eateries, there is a small fee to enter but it's a good things as it keeps the hoards of people in the tourist area outside."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "virgovim",
    "user_loc": "香港",
    "bubble": "30",
    "add_time": "2012年4月7日",
    "title": "Big and crowded (not difficult to get around with a kid in a stroller)",
    "content": "The garden complex buildings are great to view, if not for the fact that there seem to be a million people around you. Then there's the hundreds of shops and restaurants that also assault your every other (remaining) senses. I suppose, given the lack of historical areas to visit in Shanghai, you should not miss this. And, there's actually some good bargains to be picked up for tea and other souvenirs. Also the famous Nanxing steamed bun restaurant, where the \"Outer Sell\" (takeaway) line is super long - but where you can go up to the 3rd floor and get a table fairly quickly - it's worth a pit stop for the food. All in all, it's not difficult to navigate with a kid in a stroller, so don't let the crowds put you off."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "keentravellerDelhi",
    "user_loc": "新加坡新加坡",
    "bubble": "50",
    "add_time": "2012年5月16日",
    "title": "Serenity in Madness",
    "content": "What a beautiful place - RIGHT in the middle of the market, noise and madness.... Once you enter the Yu Garden, it changes! Yes, there may be many visitors, but the serenity, the beauty and the architecture are marvellous."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "MarleneB924",
    "bubble": "50",
    "add_time": "2012年4月24日",
    "title": "Yu Gardens",
    "content": "A must see. The old part of Shanghai with narrow alleys and which lead to the park. A peacful oasis in the midst of the hustle and bustle. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Yusna",
    "user_loc": "新加坡新加坡",
    "bubble": "30",
    "add_time": "2012年5月23日",
    "title": "Up charge to the max",
    "content": "The way they put the price is pretty scary. It not only double or triple bu it's multiple. Really need to bargain to at leat quarter frm the offered price."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Ready2Go4it",
    "user_loc": "俄亥俄托莱多",
    "bubble": "40",
    "add_time": "2012年4月21日",
    "title": "Peaceful gardens",
    "content": "The garden is beautifully laid out, well worth a visit."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "njschultz",
    "user_loc": "华盛顿西雅图",
    "bubble": "50",
    "add_time": "2012年4月20日",
    "title": "Calming",
    "content": "Even with lots of visitors, this refuge in the middle of a city of millions is relaxing and beautiful. Walking from the shoulder to shoulder crowd of shoppers just outside the garden to inside the gate is extreme...and very lovely. Flowers blooming in April... Absolutely would go back!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Abfedern",
    "bubble": "50",
    "add_time": "2012年4月19日",
    "title": "Wonderful oasis.",
    "content": "This is a must. It is a beautiful garden in the old town."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "SharonB615",
    "user_loc": "俄亥俄辛辛那提",
    "bubble": "20",
    "add_time": "2012年4月19日",
    "title": "Just OK",
    "content": "Very touristy. Huge crowds and many junky shops. If you go, do pay the fee to get into the gardens, if nothing more than to get away from the crowds a bit. I did have the wonderful steamed buns for lunch and then couldn't wait to get out of the area."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "VaughnR_12",
    "bubble": "30",
    "add_time": "2012年4月18日",
    "title": "It's a pretty getaway, but it looks like all the other gardens",
    "content": "This says it all. I've been to so many gardens and they all look the same. Just go to see it for yourself if you've never seen a Chinese garden before. Once you see it, you're pretty much good for the rest of the gardens in China. It's a shame but I'm being honest. Sometimes it's better to go to the gardens with specific attributes (like a garden that specializes in Cherry Blossoms) and go when they're in bloom."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "zizi002",
    "user_loc": "弗吉尼亚Danville",
    "bubble": "40",
    "add_time": "2012年4月18日",
    "title": "Wonderful Spring Break",
    "content": "I love the history behind the Garden - No dislikes"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "StevenM706",
    "user_loc": "澳大利亚纽卡斯尔",
    "bubble": "30",
    "add_time": "2012年4月17日",
    "title": "if your in Shanghai you have to see",
    "content": "Its just one of those places that you will go to in shanghai, much the same as most tourist places, full of shops with over priced rubbish but some good cafes not to pricy "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "mjmf",
    "user_loc": "哥伦比亚特区华盛顿特区",
    "bubble": "40",
    "add_time": "2012年5月2日",
    "title": "All the tea in China",
    "content": "Yuyuan Gardens looks like the setting for a martial arts period piece set in dynastic China - a warren of large pagoda-style buildings surrounding a few courtyards and the actual Yu Gardens. The stores within the area and along the road that runs through it are fascinating, and you'll find alot of stores that sell Chinese candy, curios and tea. Lots of it. Definitely worth visiting."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "China_Chiel",
    "user_loc": "上海市",
    "bubble": "40",
    "add_time": "2012年5月1日",
    "title": "Worth a visit, but if you have time Suzhou has better examples",
    "content": "A good example of a traditional Chinese \"rock and water based\" garden, not nearly as tranquil or Zen like as the gardens in Japan ( and in Shanghai the pressing throngs mean it's unlikely you'll ever find it tranquil), if you have time to travel further afield then seek out examples out of town, if not then it's worth experiencing the Chinese view of \"Landscape Gardening\"!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "amylouiseShanghai",
    "bubble": "40",
    "add_time": "2012年5月1日",
    "title": "The China of my childhood fantasies",
    "content": "Crowded and touristy, but this place represents what I thought China would be like. The garden is lovely (although not on par with Hongzhou or Suzhou), the shops are colorful (although absurdly over-priced), the 14 turn bridge is iconic, and the whole place feels a bit like Epcot. Never-the-less, I find myself going back frequently.The lanters, the colors, the smell of incense from the temple, the street food, the crowds...somehow it all works for me"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Leucas",
    "user_loc": "巴西圣保罗",
    "bubble": "50",
    "add_time": "2012年4月30日",
    "title": "Beautiful",
    "content": "Beautiful place to visit, Chinese gardens, trees, peaceful place. Worth a visit!"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "KH32",
    "user_loc": "威斯康星密尔沃基",
    "bubble": "50",
    "add_time": "2012年4月28日",
    "title": "400 year old Gingko tree.",
    "content": "Few tourists here. Beautiful gardens and interesting architecture of the the building within the garden. Neat and clean. Worth visiting."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "gnarfle23",
    "user_loc": "加利福尼亚雷丁",
    "bubble": "50",
    "add_time": "2012年4月26日",
    "title": "A must see for garden junkies!",
    "content": "The garden manages to convey serenity despite the crowds. No mean achievement in a city of 22 million people."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "olie293",
    "user_loc": "澳大利亚Buderim",
    "bubble": "50",
    "add_time": "2012年5月11日",
    "title": "Wow what a great garden",
    "content": "This garden is a series of gardens within gardens and took some 18 years to build. There are water features and amazing shaped rocks, all natural but not local, which blend in so well and allow a peace full walking place in which to get lost."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AdnanN732",
    "user_loc": "浙江省义乌市",
    "bubble": "10",
    "add_time": "2012年5月11日",
    "title": "Could be preserved.",
    "content": "Looks green and good but not worth the walk... Not preserved as it should have been done...or maybe ive seen better places than this thus did not like the visit."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "mdhrd",
    "user_loc": "加利福尼亚旧金山",
    "bubble": "40",
    "add_time": "2012年5月9日",
    "title": "Pricy little place",
    "content": "Yu Yuan Garden has beautiful architecture that gives you an age-old feel of China...however, since it has a lot of shopping places in it, haggling is a must...also you can get better deals outside of the garden."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "travelwithkid99",
    "bubble": "50",
    "add_time": "2012年5月7日",
    "title": "must see",
    "content": "a large area with lots of shopping and in the middle is the garden. you have to pay to enter. really cool. plenty of temples"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "expatmomdiaries",
    "user_loc": "新加坡新加坡",
    "bubble": "50",
    "add_time": "2012年5月5日",
    "title": "A must-see attraction in Shanghai",
    "content": "Yu Yuan Garden has beautiful temples, Chinese gardens and lots of stalls that offer local street foods and souvenirs (learn to haggle for the souvenirs could be pricey). Language could be problem though. Overall this is a must see attraction in Shanghai, it is easily accessible through MTR, just follow the signs."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "FishF",
    "user_loc": "上海市",
    "bubble": "50",
    "add_time": "2012年5月4日",
    "title": "tradition....of China....you must see and do a bit of shopping around Yu Garden",
    "content": "compact and exquisite, and the rocks, pavilions, ornamental ponds and flower walls offer some of the most attractive sceneries in Yuyuan Garden"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Rohitkale",
    "bubble": "50",
    "add_time": "2012年5月3日",
    "title": "The history preserved in the middle of the Mega City",
    "content": "Its an excellent garden. A must see for everyone. The Lantern Festival during the Spring Festival Holiday is worth Seeing. Good place to buy Chinese Souvenirs "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Silverlucky",
    "bubble": "50",
    "add_time": "2012年5月3日",
    "title": "A glimpse of the past",
    "content": "If you enjoy a stroll or walking, you can walk to Yu Yuan from The Bund (that's what we did)."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Dr_Bingcarlos",
    "user_loc": "菲律宾奎松市",
    "bubble": "30",
    "add_time": "2012年5月3日",
    "title": "Should have been a nice place for relaxation if not for the crowd.",
    "content": "This garden was just a stone's throw away from our hotel and we visited it in the morning as soon as it opened, hoping to enjoy the place and its tranquility. We were wrong. About five minutes inside the garden, a throng of tourists from a cruise ship suddenly appeared and ruined our visit. Every nook and corner of the garden was full and we couldn't enjoy a quiet moment or even the views of the garden. The garden itself has beautiful rock formations and some exhibits but the flowers were not as colorful as in some other areas in Shanghai. I can imagine that this is a great palce to just enjoy the peace and quiet but it is impossible to do that with hundreds of noisy tourists around."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Casa131",
    "user_loc": "香港",
    "bubble": "40",
    "add_time": "2012年5月16日",
    "title": "Nice surrounding to shop for your souvenirs and to try out the famous dumplings",
    "content": "Berepared the the shops are very touristic and the famous dumpling shops have long waiting list. Watch out for pickpocket too."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Jirmi",
    "user_loc": "上海市",
    "bubble": "50",
    "add_time": "2012年5月15日",
    "title": "Stunning",
    "content": "Get the feel of the old town while getting lost at YuYuan Garden. Shop for some souvenirs, eat some local food, take snap shots of the beautiful buildings but do avoid on the weekend and public holidays then the beautiful surroundings are clouded by a sea of bobbing dark heads."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "mybestchina",
    "bubble": "50",
    "add_time": "2012年5月15日",
    "title": "Shanghai must see on tourist trail",
    "content": "The garden itself was fairly quiet on Saturday lunch time (you have to pay a small fee to get in) but the streets around it were heaving with people which spolied the experience a little."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Sailorwoman",
    "user_loc": "佛罗里达克利尔沃特",
    "bubble": "50",
    "add_time": "2012年5月14日",
    "title": "Beautiful Gardens so well layed out with many many buildings",
    "content": "Walking by the Tea House and all the big orange fish in the pond was quite a sight to see. The ever winding gardens were lovely,"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Boyscot",
    "bubble": "40",
    "add_time": "2012年5月14日",
    "title": "A very touristy place",
    "content": "Beautiful layout and could be a peaceful oasis, ruined by too many isitors and guides with portable loudspeakers"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "mjrg59",
    "user_loc": "爱荷华锡达拉皮兹",
    "bubble": "40",
    "add_time": "2012年5月13日",
    "title": "A lovely respite in a private garden restored and open for visiting",
    "content": "Right outside, the neighborhood is filled with shops and people but inside the garden there is peace and calm. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "BombayLiz",
    "user_loc": "德克萨斯州休斯顿",
    "bubble": "50",
    "add_time": "2012年5月13日",
    "title": "A Lovely Oasis",
    "content": "This is a beautifully landscaped park adjacent to a shopping area (that is pretty much designed for tourists). The park is historic and a great example of Chinese landscape design. It makes for a pretty half hour walk in between busy commercial Shanghai stops along the way."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "tripellen",
    "bubble": "50",
    "add_time": "2012年5月12日",
    "title": "Wonderful",
    "content": "My favourite attraction in Shanghai. The gardens are delightful and shops inside sell quality historical Chinese items. The teahouse and markets were great, I loved the place."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "WillemanEsme",
    "bubble": "50",
    "add_time": "2012年6月11日",
    "title": "Pleasant",
    "content": "A travel agent,took us on a day tour.She had a very good knolledge of the history of the garden.I will recommend that you visit the garden with a tour guide.You will miss a lot of what everything meens if you just go by yourself."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Cabsauve",
    "bubble": "50",
    "add_time": "2012年5月12日",
    "title": "We loved this garden",
    "content": "It was very intimate and pretty and we enjoyed taking photographs here."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "LundehundMom",
    "bubble": "50",
    "add_time": "2012年5月23日",
    "title": "Yu Yuan Gardens is so exciting.",
    "content": "i always go here to get my silk items for gifts. The dumplings here are famous. Low end to high end pearls. Do not go to Shanghai and not visit this place. The gardens are beautiful."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "planetseb",
    "user_loc": "加拿大渥太华",
    "bubble": "40",
    "add_time": "2012年5月23日",
    "title": "Lovely gardens",
    "content": "Beautiful space.  Best to go on a weekday as it gets very very crowded with local tourists on the weekends"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Jamies_oyster",
    "user_loc": "纽约州布鲁克林",
    "bubble": "40",
    "add_time": "2012年5月22日",
    "title": "A quiet haven in the middle of a madhouse...",
    "content": "This place is a maze- even though it's not huge, you can easily get lost within its walls. It IS a very welcomed break from the surrounding craziness. If you're tired of brushing up against people, getting cut off and cut in front of- shoved around and coughed on... I suggest hopping in for your peace of mind. The garden is beautiful- and offers plenty of shade on hot sunny days. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "nothe2le",
    "bubble": "40",
    "add_time": "2012年5月21日",
    "title": "excellent example of classical chinese garden",
    "content": "Lovely garden with all the elements that constitute a classic garden, like bridges, ponds, pavillions, covered corridors, rockeries and even a theatre. Hard to believe that such beauty can be hidden in the centre of the city. Centrally located. Crowded on weekends and public holidays."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "MarcS442",
    "user_loc": "瑞士苏黎世",
    "bubble": "40",
    "add_time": "2012年6月22日",
    "title": "Touristic and not that old...",
    "content": "This place is only to attract tourists and does not represent Shanghai at all..."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Ekristanti",
    "user_loc": "荷兰阿姆斯特丹",
    "bubble": "40",
    "add_time": "2012年5月21日",
    "title": "Happy to walk around the beautiful ancient garden in Shanghai old town",
    "content": "We were in Shanghai last weekend, it was an unexpected freezing weather in almost summer - because it was raining and windy. Still there was so many people at the garden, lots of foreigners too."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Beebo73",
    "user_loc": "埃及开罗",
    "bubble": "50",
    "add_time": "2012年5月21日",
    "title": "Not a must see if you dont have time.",
    "content": "The garden is big, releatively clean but I was not lucky because I went on a Saturday which was a weekend, very crowded to the extent that you cant enjoy from the crowds. Even the surronding area was croweded. But its worth going if you are in Shangahi and have the time to see it."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Armin1981",
    "user_loc": "伊朗Kermanshah",
    "bubble": "50",
    "add_time": "2012年5月20日",
    "title": "Not safe neighborhood.",
    "content": "this garden is so amazing with a lovely story. old city is so beautiful but watch out your bag and money. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "chris4502",
    "user_loc": "英国Halesowen",
    "bubble": "50",
    "add_time": "2012年5月20日",
    "title": "Busy, busy, busy.",
    "content": "Not for the shy but many shops to enjoy and take time to relax in the old Tea house as we'll as going in to the gardens themself."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "kmstpete",
    "user_loc": "佛蒙特Arlington",
    "bubble": "50",
    "add_time": "2012年5月18日",
    "title": "Beautiful patch of old China",
    "content": "Take a stroll through these lovely gardens when you need a break from the modern city."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "AravindBabu",
    "user_loc": "宾夕法尼亚Glen Mills",
    "bubble": "30",
    "add_time": "2012年6月30日",
    "title": "Chinese style garden",
    "content": "The you garden is right in the middle of shanghai. It's a garden which was designed in the olden days. It's very pleasing Chinese style garden - lots of rock formations, koi pond. Lots of Chinese trinkets shops around the garden. Best place to pick up souvenirs for back home."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "SYTrips",
    "user_loc": "加利福尼亚洛杉矶",
    "bubble": "50",
    "add_time": "2012年6月2日",
    "title": "Great Place, give your self ample time",
    "content": "The garden went on, and on, and on. But in a good way. There are so many different passage ways. I can't imagine the man who built this garden for his parents. This garden was quite immense, and went on passage way after passage. Its like you are in a serene maze. I only gave myself an hour to tour the garden. However, I could have easily spent 2 hours if I took my time, and sat at some of the locations. "
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "GaiMike",
    "user_loc": "以色列贝尔谢巴",
    "bubble": "50",
    "add_time": "2012年6月2日",
    "title": "The best example of Chines gardens",
    "content": "That garden represents the lifestile of the rich chinese families. It is planned so, that after every corner you find a new point of view on an artificial landscape, with wonderfull shapes of rocks, plants, pavilions and if you look at the roofs, strange mystical creatures statues. The garden located in the center of the renewed chinatown that functions as a big bazar. a realy must in Shanghai."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "PH_12",
    "user_loc": "马里兰埃利科特城",
    "bubble": "50",
    "add_time": "2012年5月30日",
    "title": "Excellent Garden",
    "content": "We were truly fascinated with the preservation and maintenance of the gardens."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "ChrisandMick60",
    "user_loc": "法国Montaren-et-Saint-Mediers",
    "bubble": "40",
    "add_time": "2012年5月29日",
    "title": "Beautiful but crowded",
    "content": "The gardens are entered by passing through an area that looks as if it could be 200 years old but was in fact only built 30 years ago. There are masses of souvenir shops, street vendors and street performers. The gardens are really beautiful but even in April, the low season, there were an awful lot of visitors. Just to see the Koi made the visit worthwhile. The gardens are best appreciated if you have a guide, there aren't many information notices."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Chunky353",
    "user_loc": "香港",
    "bubble": "50",
    "add_time": "2012年5月29日",
    "title": "Beautiful",
    "content": "Stopped off here as part of the Big Bus Tour hop on hop off and it is definitely worth seeing. The area around the gardens is also very cool with lots of chinese style buildings and arts and crafts. The gardens themselves are huge. Its like a little maze but very nice and unique and I would highly recommend visiting them."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "BlondeAmbition123",
    "user_loc": "加拿大温哥华",
    "bubble": "30",
    "add_time": "2012年5月28日",
    "title": "A Classic Classical, Chinese Garden",
    "content": "Very crowded, so not very serene"
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "Joe999Charlotte_NC",
    "bubble": "40",
    "add_time": "2012年7月5日",
    "title": "Yu Garden and Old Town",
    "content": "The old town area was awesome with its old looking chinese buildings and shops galore. The Yu Garden was impressive for its location and fish ponds. Makes a wonderful afternoon stroll with lots to see and do."
  },
  {
    "language": "en",
    "verbose_name": "上海豫园",
    "username": "forgm",
    "user_loc": "罗马尼亚布拉索夫",
    "bubble": "40",
    "add_time": "2012年5月25日",
    "title": "interesting experience",
    "content": "Very nice mix of tradition and modern."
  },
