[
  {
    "username": "sleighcampbell",
    "user_loc": "俄勒冈本德",
    "bubble": "50",
    "add_time": "2018年11月15日",
    "title": "Great garden ",
    "content": "This is a 2000 year old garden that is kind of a maze. It is worth the small entrance fee charged. It is located in the middle of old Shanghai and you really don’t need a guide.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Voyager811386",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年11月14日",
    "title": "Tourist Magnet",
    "content": "This area was really busy at the weekend, but quieter early on a weekday. We made a return visit in order to look properly at the buildings. They are very authentic and you would think they were really old rather than relatively recent constructions.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "elizabethbA6LC",
    "user_loc": "英国泰晤士河畔金斯敦",
    "bubble": "50",
    "add_time": "2018年11月13日",
    "title": "Afternoon excursion.",
    "content": "This exquisite garden is a window on the past. The buildings are exquisite and there are various nooks and crannies throughout. It is a restful, peaceful place well worth a visit.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "EBY_NYC",
    "user_loc": "纽约州纽约市",
    "bubble": "40",
    "add_time": "2018年11月13日",
    "title": "Crowded",
    "content": "We visited during Golden Week, and got to enjoy the crush of every time being on vacation along with the local tourists. Went for very pricy tea in a teashop above the garden. It was a nice break for all the hustle and bustle down below.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Reklaw252",
    "user_loc": "加拿大Battleford",
    "bubble": "50",
    "add_time": "2018年11月12日",
    "title": "Breath taking and enchanting",
    "content": "This is one of the highlights of a two week tour of \"important\" sites we visited over a period of two weeks.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "cateoharea",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年11月12日",
    "title": "Fantastic at night with lights",
    "content": "Wonderfully lit up and beautiful place to visit and roam. It is crowded but I didn't mind the crowds since it was so visually stimulating.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Tilliclax",
    "user_loc": "瑞士莫尔日",
    "bubble": "50",
    "add_time": "2018年11月12日",
    "title": "Delightfully Unexpected !",
    "content": "If you've got a couple of hours to spare in Shanghai, then a visit to this spectacular formal 16th century garden is a must. Yes, it's busy, but try to find a 'quiet' time (early morning) and enjoy the architectural styles which will take you back a couple of hundred years .... A real flavour of Old China.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "KTMTravelBites",
    "user_loc": "澳大利亚布里斯班",
    "bubble": "40",
    "add_time": "2018年11月11日",
    "title": "Shanghai Yu Garden (Yuyuan) Is Very Beautiful But Crowded",
    "content": "The Yu Garden in Shanghai is simply beautiful with so much history to take in. I would recommend to go first thing in the morning as I would say this is when you would see it at its best (without the crowds - we found a lot of them are very pushy). It would be amazing to be able to take in the serenity of the gardens, pagodas etc and really enjoy the ambience - and get great photos without too many people in them! It is worth visiting, but go early to make the most of it.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "walkinthewoods",
    "user_loc": "华盛顿西雅图",
    "bubble": "50",
    "add_time": "2018年11月10日",
    "title": "The Gardens are great",
    "content": "Enjoyed the gardens very much and they themselves are worth a trip there. The rest of the area apparently was all recreated in an old town chinese style and is loaded with shops and restaurants. Very interesting to walk through and experience. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "SueJim126",
    "user_loc": "英国谢菲尔德",
    "bubble": "50",
    "add_time": "2018年11月10日",
    "title": "Only surviving Ming Dynasty Garden in Shanghai",
    "content": "Exquisite garden, decorated bridges, colorful pagodas and intimate enclaves separated by \"dragon walls\" — partitions with dragon decorations on top and the Jade Rock, said to have been one of Song Emperor Huizong's private collection. Crowded but well worth a visit.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "iloond",
    "user_loc": "菲律宾长滩岛",
    "bubble": "40",
    "add_time": "2018年11月10日",
    "title": "Nice but crowded",
    "content": "Interesting place to visit but very crowded. Nice to see but didn't spend a long time in the garden.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "michaelpG9255BM",
    "user_loc": "澳大利亚悉尼",
    "bubble": "40",
    "add_time": "2018年11月8日",
    "title": "Intresting Complex",
    "content": "The area is very interesting and there is a nice, short walk on the bridge across the small lake. BUT go early as it gets very crowded as the day goes on.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "817nehap",
    "user_loc": "印度新德里",
    "bubble": "40",
    "add_time": "2018年11月6日",
    "title": "Very very busy",
    "content": "The area around the Yu Garden is beautiful and so full of people. There are so many shops especially for Shanghai local cuisines. Candy shops and Chinese handicrafts shop. I really liked the marker area around the Yu Garden more. The ticketed entrance was 40 yuan each and was not worth it.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "BrettH53",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年11月5日",
    "title": "Tourist",
    "content": "Nice to have a walk around. A respite from busy Shanghai. Great for photos. Spent about 30-40 minutes",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "MCB6568",
    "user_loc": "加拿大蒙特利尔",
    "bubble": "30",
    "add_time": "2018年11月5日",
    "title": "Nice but be prepared for the crowd!",
    "content": "Its an impressive « familly » house. Lovely gardens in the very middle of the City! Most living space similar to my none specialized eyes... but the crowds are taking away from the peace of mind one should enjoy in this place..",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "skp288",
    "user_loc": "新加坡新加坡",
    "bubble": "10",
    "add_time": "2018年11月4日",
    "title": "Not worth going",
    "content": "Supposedly a historical site with an ancient temple (closed at the early hour of 4.30 pm). In actual fact there’s nothing there except shops. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Trail757654",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年11月4日",
    "title": "Amazing history.",
    "content": "Yuyuan Gardens are amazing. The old culture and history is gives the garden a unique apparel. It's a peaceful escape from the crazy busy sights and sounds of the city. I read about it in a travel book and I listed it at the top of my list of things to do in Shanghai and it did not disappoint me. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "ESTEVEA",
    "user_loc": "加利福尼亚圣罗莎",
    "bubble": "50",
    "add_time": "2018年11月2日",
    "title": "A must see and experience while in Shanghai",
    "content": "Do not miss this Garden and Bazaar !!! So much fun. First the gardens and all the koi are amazing. There are views from every direction. Just wander about and you will be thrilled. Eveyone is taking photos of everyone. Then there is the Bazaar which surrounds the gardens. Everything you could ever want in items is here for you. Even explore the upper levels and there is even more for you to buy, buy, buy !!! Everything from Nike to ancient jade. Just keep exploring. Leave plenty of time for you to explore and have lunch or dinner.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "isa_perth",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年11月2日",
    "title": "Must see",
    "content": "Beautiful gardens and temple well worth visiting, amazingly crowded. We were with a tour guide who explained many details we would otherwise have missed.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "elvin2018",
    "user_loc": "印度孟买",
    "bubble": "40",
    "add_time": "2018年11月2日",
    "title": "An Unusual Attraction",
    "content": "A visit to the Yuyuan garden is a different experience. One has to meander through a few lanes with typical Chinese architecture buildings of a bygone era that is a busy and colourful market today, selling souvenirs, food, fashion. boutiques etc. until you come to a bridge that has a few left and right turns that take you to the entrance of this garden. The bridge itself is a fun place with lots of things in the water below: small isles with pretty plants, fish, ducks etc and people throng here to take pictures/selfies etc. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "alstrchm",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年11月2日",
    "title": "Crowded",
    "content": "Beautiful garden with antique items from Ming Dynasty. There are food stalls and souvenir shops outside. Overall, place is picture-worthy but overcrowded",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "bookwormt",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年11月1日",
    "title": "Beautiful Chinese garden",
    "content": "It is actually 3 major attractions here: garden temple and market.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Bellechasse10",
    "user_loc": "俄亥俄阿克伦",
    "bubble": "50",
    "add_time": "2018年10月31日",
    "title": "Beautiful, but crowded",
    "content": "I visited this garden thirty years ago when it was a much more impressive and pleasant experience. Now the garden is buried and hidden in a huge crowded bazaar / shopping area. There are no clear signs to the garden entrance, I had to ask several tourists. The approach to the garden has this lovely bridge, but it was black with noisy people. I enjoyed the stylish beautiful old garden, the buildings, rocks, carvings, views. Go, enjoy.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "PaulBlundell",
    "user_loc": "英国沃尔夫汉普顿",
    "bubble": "50",
    "add_time": "2018年10月31日",
    "title": "Beautiful a must to see",
    "content": "Very beautiful area. Very old traditional styled houses and tea house (tea house very expensive). Gets very busy around this area and to walk across the pathways that bridge over the water. Spend time feeding the koi carp, they are huge! Lovely shopping, maybe a little more expensive as its very touristy but lovely to spend some time. Try some bubble tea. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "cricketfanBB",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月31日",
    "title": "Classic garden",
    "content": "But very crowded. Too many tourist shops inside. But some really good buildings and sights. Probably worthwhile going with a guide",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "dolphint2017",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月31日",
    "title": "Good place to visit",
    "content": "it's my favourite place for visiting. You can enjoy to see many things like clothes, toy, food, souvenir, etc. You can visit temple nearby. Don't miss to visit this place if you come to Shanghai.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "rottrek",
    "user_loc": "捷克共和国布拉格",
    "bubble": "50",
    "add_time": "2018年11月15日",
    "title": "Another place Must see",
    "content": "Pleasant place in the middle of a modern and vibrant city. In gardens with breathtaking atmosphere to relax, gather new energy. The tour is about 1 hour if you do not hurry anywhere. Admission approximately 5 €.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-f/15/62/9c/d3/yu-garden-shanghai.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "greatcanadiantea",
    "user_loc": "加拿大蒙特利尔",
    "bubble": "50",
    "add_time": "2018年11月14日",
    "title": "Must visit place in Shanghai ",
    "content": "Classic Chinese garden with beautiful architecture. Unique zigzag bridge with lots of fish in the pond. Many craft shops and local restaurants. The famous soup dumpling was originally from one of the restaurants there. There is a very cute Chinese tea house located in the middle of the pond looks like a big gazebo. All rosewood Chinese style furniture, they have different types of tea selections; and even visited by Queen Elizabeth II in the 1980’s. This is a must visit in Shanghai.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/5e/ca/06/photo3jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/5e/ca/0c/photo8jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/5e/ca/0d/photo9jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/5e/ca/08/photo5jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "anarchius",
    "user_loc": "威斯康星沃基肖",
    "bubble": "40",
    "add_time": "2018年11月13日",
    "title": "An unending maze",
    "content": "This place is fun. Getting there can be tricky and rather crowded (there is a single doglegged bridge you need to cross), but once you are inside the crowds (relatively) thin out. The place is massive, beautiful and interesting. Without a lot of direction or signage, you basically stroll along, finding forks in the roads, taking them and trying to imagine what the other road would be like. There are bridges, tunnels, rooms, buildings, gardens, ponds (with Koi), deadends, rock sculptures, bonsai's and water jade. Basically an explosion of sights all strung together in a surprisingly cosy yet extensive location.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-f/15/5d/d2/17/the-garden.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/5d/d2/53/the-garden.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "aditip900",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年11月15日",
    "title": "Yu garden visit",
    "content": "Been there with my friends in winters in February.Nice place to have a look around with various food shops and shopping street around....Yu gardern is beautiful.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/62/17/d3/img-20170209-wa0054-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/62/17/d0/img-20170209-wa0002-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/62/17/d5/img-20170209-wa0056-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/62/17/d8/img-20170209-wa0059-largejpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "JuWhit",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月31日",
    "title": "Get clear directions before you set off",
    "content": "Had huge trouble finding this - met half a dozen people in the same situation (including a Chinese tourist). When we got to the entrance, I wasn’t sure why it was so difficult. I think we got caught up in the alleyways around beforehand. We went on a Sunday and it was very busy. Not sure it would be different on another day. It is beautiful and worth visiting. If you don’t get to Suzhou, I think this is an excellent alternative. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "WorldTravler1946",
    "user_loc": "加利福尼亚洛杉矶",
    "bubble": "30",
    "add_time": "2018年10月30日",
    "title": "Too commercial",
    "content": "We were here about 12 years ago and now it is very commercial. So many vendors selling the same things. It was such a pretty place before.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "514fatouz",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月29日",
    "title": "To discover",
    "content": "Please do not limit yourself by staying on the first Street. Go further in the market as you will be able to see some of the greatest Chinese architecture.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "G6426FManthonys",
    "user_loc": "澳大利亚布里斯班",
    "bubble": "40",
    "add_time": "2018年10月29日",
    "title": "Oasis in the city",
    "content": "Ver6 pleasant garden in the city where the sounds of the city don’t seem to penetrate. Lovely old gardens and buildings interspersed with ancient walls and moon gates.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "wmk168",
    "user_loc": "",
    "bubble": "30",
    "add_time": "2018年10月29日",
    "title": "Tasteless food",
    "content": "The food in foodcourt near gate 7 is tasteless and expensive. Floor is dirty and oily. Souvenirs has to be bargained carefully. It is a lot more higher that outside. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "greynomad101",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月29日",
    "title": "Yu Gardens A Calm Oasis",
    "content": "WE did this tour as part of a 14 day tour organised by Top China Travel.. Our guide in Shanghai was Leo. He took us to Yu Gardens and adjoining market as part of our Shanghai Tour. This area is really worth visiting and is close and convenient to other major tourism sites. He is energetic, passionate and we all quickly became friends. Our driver was Mr Wong who beyond expectations to ensure our travels were safe and enjoyable, including making sure we got to the airport in plenty of time for our flight",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Sourabh-Joshi-INDIA",
    "user_loc": "印度新孟买",
    "bubble": "50",
    "add_time": "2018年10月29日",
    "title": "Yu Garden is Stunning!",
    "content": "This is the major stop when in Hop in Hop off bus tour. It does not disappoint you in any manner. It is beautiful. Though its very crowdy but its really stunning. You will feel awesome here. Also, you can have a lot of shopping in old town area.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "836fayen",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月29日",
    "title": "A must visit at night!",
    "content": "A must visit at night! It's a bit crowded but let's do it for the 'gram.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "robertsY6172QZ",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月28日",
    "title": "A nice oasis in the middle of Shanghai",
    "content": "We accidentally came across the gardens in a shopping area and rather that spend time in shops we spent the time in the gardens and thorough enjoyed the peace and serenity. It was a very nice break from the commercialism.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "susimaBeirut",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年11月10日",
    "title": "Old vintage garden beautiful to see",
    "content": "Beautiful garden ",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/52/76/64/photo0jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "448marcom448",
    "user_loc": "墨西哥Celaya",
    "bubble": "50",
    "add_time": "2018年11月8日",
    "title": "So beautiful!",
    "content": "In the heart of Shanghai, something you must see! Near to the bund, totally worth it. Great garden, and history.",
    "image_urls": [
      "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "https://ccm.ddcdn.com/ext/photo-s/15/4a/ae/86/img-20181028-114530415.jpg",
      "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "https://ccm.ddcdn.com/ext/photo-s/15/4a/ae/87/img-20181028-114450983.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "cwtraveller2017",
    "user_loc": "密歇根安娜堡",
    "bubble": "50",
    "add_time": "2018年11月11日",
    "title": "Great shopping entertainment and culture",
    "content": "Takes 3 visits to see it. The day visit for the narrow market streets and the zigzag bridge. The Visit to the actual ancient gardens - for peace and tranquility in the middle of downtown Shanghai. And finally the night visit - to see it lit up - spectacular!",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/53/dc/49/photo0jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/53/dc/4a/photo1jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "ggold123",
    "user_loc": "上海市",
    "bubble": "50",
    "add_time": "2018年11月12日",
    "title": "The Lantern Festival at Chinese New Year is a must!",
    "content": "If you're lucky enough to visit Shanghai during Chinese New Year, you must visit Yu Garden to see the Lantern Festival. it is a spectacular display, not just of lanterns, but giant lit dioramas laid out in succession as you follow a path through the ponds. It can get crazy crowded and you need to buy a ticket, but it's worth it. And while you're there, there's lots of shopping and food nearby. The soup dumplings that are served with a straw and the amazing Shanghai dumplings that are fried on the bottom and steamed on the top are a must! So delicious.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/56/f4/cb/chinese-new-year-lantern.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/56/f8/13/shanghai-dumplings-up.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/56/e6/b3/chinese-new-year-lantern.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/56/f5/77/chinese-new-year-lantern.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "laj2e7",
    "user_loc": "佛罗里达奥兰多",
    "bubble": "40",
    "add_time": "2018年11月12日",
    "title": "Beautiful garden and home",
    "content": "This is a great example of the home gardens . There are dragons in the architecture . This a fun way to spend an hour or 2. There is a fee to enter the gardens . I would recommend a tour guide to explain what you are looking at . There are coy ponds throughout the gardens . The terrain is a little rocky and can be slippery when wet . The contrast with the old and new was also visible here. There are examples of weapons and coins . ",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/57/f3/08/photo0jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/57/f3/0d/photo3jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/57/f3/0a/photo1jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/57/f3/0c/photo2jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Ptuji",
    "user_loc": "英国伦敦",
    "bubble": "50",
    "add_time": "2018年10月28日",
    "title": "Stunning",
    "content": "Busy but peaceful if you know what I mean. Very old trees well laid out and historical. Go early. Access via old town so you can shop afterwards ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "betteskid",
    "user_loc": "马萨诸塞波士顿",
    "bubble": "40",
    "add_time": "2018年10月28日",
    "title": "Very nice garden - but can be a bit crowded",
    "content": "I visited here on a weekday afternoon and enjoyed the garden. It is quite large and the leaves were just beginning to turn when I was there. The garden is also near a large market, making it easy to do some shopping after you have seen the garden. The various ponds and buildings are all well-maintained. I would have preferred a visit when there were fewer people, but it is a major attraction, so perhaps arriving at the start of the day would be better.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "vegasrugbyref",
    "user_loc": "内华达拉斯维加斯",
    "bubble": "50",
    "add_time": "2018年10月28日",
    "title": "Chinese Garden ",
    "content": "Another must do when visiting Shanghai. Located in the mainland side of the Bund area. EASILY a few hours of good free excursion. Traditional Chinese culture and garden. Busy in afternoons. Food in area. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "CraigandDiS",
    "user_loc": "新西兰惠灵顿",
    "bubble": "50",
    "add_time": "2018年10月27日",
    "title": "Magic",
    "content": "With the crowds outside and the queues, I anticipated a chaotic scene inside this favourite garden. But no, the garden just seems to absorb the crowds into its many tranquil rooms. A beautiful, contemplative place. Don’t be put off by the hustle and bustle outside.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "petercot",
    "user_loc": "英国剑桥",
    "bubble": "40",
    "add_time": "2018年10月26日",
    "title": "Picturesque but crowded ",
    "content": "Set in middle of shopping streets, provides a bit of an oasis. But it is crowded. Small lakes are stuffed with large fish. Some interesting plants",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "StephenGlobeTrotter",
    "user_loc": "英国阿什伯恩",
    "bubble": "40",
    "add_time": "2018年10月24日",
    "title": "Beautiful gardens dating from 1559",
    "content": "This is a classic tourist stop in the Shanghai Old Town, and we highly recommend to you. We’d suggest hire a guide to get the best overall experience and to learn the meanings of each feature - building, inscription, floor surface, etc.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "dhanatthat",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月24日",
    "title": "Very crowded.",
    "content": "I came here a couple times and every time I visited the crowds never go away! I like to come here for the famous xiao long bao. There is an old tea house located right in the middle of the garden. It’s quite nice with the small olden tables and chairs.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "sereneloh2018",
    "user_loc": "新加坡新加坡",
    "bubble": "30",
    "add_time": "2018年10月23日",
    "title": "Crowded tourist & historical building",
    "content": "Walking distance to & fro Metro. Crowded full of tourists, Old man / Lady chasing you to buy their fake merchandise such as handbag and watches...Freelance Tour guide (Maybe) question mark for me?? approaching & asking to try on their freelance tour services. Just don't bother, overall they wont harm you. DO take note, bring more cash with you, no money changer. You might need to search for bank and will need to pay an extra charge of RMB50 per transaction (This only applicable for certain bank (have no ideal why they have such rules). Overall i enjoyed the scenery, shopping for local products and can try to asked for bargaining good deal and The historical buildings are beautiful & Charm.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "TAMAN1951",
    "user_loc": "华盛顿Liberty Lake",
    "bubble": "50",
    "add_time": "2018年11月3日",
    "title": "Lovely grounds",
    "content": "Wonderful visit. ",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/3c/56/a5/photo4jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/3c/56/a1/photo0jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/3c/56/a2/photo1jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Athenry72",
    "user_loc": "爱尔兰戈尔韦",
    "bubble": "50",
    "add_time": "2018年11月4日",
    "title": "Night visit to yu garden and markets",
    "content": "We went to the yu garden and markets as part of our tourist experience. Lovely relaxed market but be prepared to bargain hard for any purchases. Treat this as a bit of fun and don't take any offence with some bargaining attitude. Lots to choose from for all your touristy purchases. The tea House is a lovely traditional building with surrounding pond full of large koi and ducks. Overall its a nice way to spend a few hours some evening, definitely recommend it. Excuse the poor pics... ",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/3e/1a/4f/dsc-2952-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/3e/1a/50/dsc-2951-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/3e/1a/51/dsc-2944-largejpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "heidil290",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年11月4日",
    "title": "Very interesting wholesale market and sightseeing spot!!!!",
    "content": "Yu Garden was built in the 15th century and is now a tourist sightseeing spot in Shanghai. There is an old garden as well as surrounding area with local craft works, jade/jewelries, souvenir shops, wholesale markets, local food and restaurants, etc.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/3e/da/17/photo1jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/3e/da/16/photo0jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/3e/da/1b/photo4jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/3e/da/1c/photo5jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "698michelley",
    "user_loc": "香港",
    "bubble": "40",
    "add_time": "2018年10月22日",
    "title": "Nice visit",
    "content": "It's very beautiful with it's historical buildings.  Quite crowded with tourists though.  Still worth a visit.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "516sushantm",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月22日",
    "title": "Excellent place, must see",
    "content": "Enjoyed both the garden. Friends and family enjoyed the shopping (and bargaining too), we came back to shopping next day",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "313ramyw",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月22日",
    "title": "Oh my God ! This district is a piece of art ",
    "content": "This is a must see.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "CaptainAndSparrow",
    "user_loc": "德国柏林",
    "bubble": "40",
    "add_time": "2018年10月22日",
    "title": "Very nice parc",
    "content": "Very nice location to spend some time and relax after the crowded inner city of shanghai. after 30 minutes there is not really something new to discover but the place is worth a visit",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "DMiz",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月21日",
    "title": "A must See in Shanghai",
    "content": "Wow! this place is really cool for an authentic slice of old Shanghai. We went on a Sunday and it is crazy busy, but well worth it. The gardens and buildings are spectacular. There is a small fee to enter - but just do it, you won't regret it. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "968mitchi",
    "user_loc": "英国伦敦",
    "bubble": "50",
    "add_time": "2018年10月21日",
    "title": "Amazing gardens but very busy",
    "content": "The gardens here in Shanghai are lovely. They are huge and very well taken care of. This is why there is a small entrance free of around £4. The downside is it's very busy here so it is not a garden where you can sit and relax. As soon as you leave the garden their are a million tourist stalls all trying to sell you things which also annoying.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Deb3John",
    "user_loc": "澳大利亚卡拉萨",
    "bubble": "50",
    "add_time": "2018年10月21日",
    "title": "Busy Busy Busy",
    "content": "Go early or late - this place gets busy fast. But it was worth going it gives you an appreciation of Chiese art of garden scaping. It is extremely popular on the weekends",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "36torb",
    "user_loc": "挪威Strandebarm",
    "bubble": "30",
    "add_time": "2018年10月19日",
    "title": "There are much better parks in China",
    "content": "We went here as part of a tour,and we was dissapointed ,the gardens are extremely busy with huge crowds of people. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "aggyaggy",
    "user_loc": "香港",
    "bubble": "40",
    "add_time": "2018年10月31日",
    "title": "Nice for photo taking ",
    "content": "Went there with two friends, a bit crowed inside quite a lot of tourists, nice for taking pictures of traditional chinese style buildings ",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-f/15/35/c8/cb/yu-garden-yuyuan.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/35/c8/24/yu-garden-yuyuan.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/35/c8/26/yu-garden-yuyuan.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/35/c8/22/yu-garden-yuyuan.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Amthu",
    "user_loc": "缅甸仰光",
    "bubble": "40",
    "add_time": "2018年10月31日",
    "title": "Go with a tour guide ",
    "content": "The garden is tucked behind Yuyuan bazaar. We went with a tour guide so didn’t have any trouble to find it. I suggest it’s better to go with a tour guide so that you can have insightful knowledge of its history rather than going there to take pictures only. Yu garden is very beautiful although the size is not very big compared to Lingering garden in Suzhou. ",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/35/a1/7a/photo0jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "sarahu1981",
    "user_loc": "新西兰惠灵顿",
    "bubble": "40",
    "add_time": "2018年11月2日",
    "title": "Locelu",
    "content": "The area of Yuyuan gardens is easy to get to as it’s a stop on the metro. Actually getting in to the gardens was hard. When you walk out of the metro and get to the Main Street, you need to walk in to the centre of the shopping area. Once in there, follow the signposts. You’ll walk across some bridges over the water and past the famous tea house. Keep walking around the path and you’ll finally come to the ticket office. Then you can enter the actual gardens.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/39/21/b3/photo5jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/39/21/b0/photo3jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/39/21/b4/photo6jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/39/21/b1/photo4jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "klb32018",
    "user_loc": "卡罗莱纳州夏洛特",
    "bubble": "20",
    "add_time": "2018年10月18日",
    "title": "Too Touristy",
    "content": "Decent garden and it is a nice slice of tranquility in an otherwise busy city. But the garden is a total tourist trap. Go instead to the former French Concession for free gardens with better food and smaller crowds.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "396charlottee",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月17日",
    "title": "Slice of tranquility",
    "content": "Beautiful gardens with historic buildings and picturesque ponds. A wonderful afternoon had wandering around these pretty gardens. Wonderful opportunity to take some nice photos of my children. They loved watching the giant koi. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Samsgrrl00",
    "user_loc": "加利福尼亚旧金山",
    "bubble": "30",
    "add_time": "2018年10月17日",
    "title": "We went during a Golden Week- DON'T go during a Golden Week",
    "content": "This place is probably very cool to experience, but not on a GOLDEN WEEK-- with a literal million other people. It's beautiful but just getting to the point of entry was crazy. Like a crush of humanity, no organization at the ticket counter- just push and prod your way to the counter. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "annalZ2652MC",
    "user_loc": "新加坡新加坡",
    "bubble": "50",
    "add_time": "2018年10月16日",
    "title": "Ancient garden",
    "content": "The garden has been around for a long time, over a few hundred years. Very splendid. The garden style is that of a private garden, meaning the garden owned by a family has this kind of style in the olden days. We were attracted to the many koi fishes and some terrapins in the pond, which surrounds the garden. If one observes closely there are many fine details in the architecture in the garden. Each window has a different design. The whole garden is ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "marim705",
    "user_loc": "英国伦敦",
    "bubble": "50",
    "add_time": "2018年10月16日",
    "title": "Nice",
    "content": "Really good place , culture , nature , food and shopping near by , not expensive 40 yuans to go in !!! ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Odyssey402460",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月16日",
    "title": "Old China in new Shanghai",
    "content": "This felt like a hidden gem in the middle of the bustle of Shanghai. Although there is usually quite the queue to get into the gardens, this moves quickly and I was distracted by the beautiful surrounds as we approached the entrance. We spent a couple of hours exploring the gardens and the buildings that hold much history.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "J8603YZdaver",
    "user_loc": "佛罗里达博尼塔斯普林斯",
    "bubble": "40",
    "add_time": "2018年10月16日",
    "title": "Brave The Crowds",
    "content": "A bit crowded, but an efficient way to see to see and experience life in a by-gone era--plenty of shops in the adjoining bazaar",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "dkgupta49",
    "user_loc": "印度法里达巴德",
    "bubble": "30",
    "add_time": "2018年10月30日",
    "title": "Nosiy, Confusing",
    "content": "Location : Best to access by Metro. Green line station East Nanjing road (Line No 02). Get down here and catch Line no 10. Yu Garden is the next station. Take exit 3 and follow the crowd.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/33/d8/4c/img-20181028-114741-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/33/d8/4d/img-20181028-120655-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/33/d8/49/img-20181028-113859-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/33/d8/48/img-20181028-113854-largejpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "tonyw488",
    "user_loc": "澳大利亚Grafton",
    "bubble": "40",
    "add_time": "2018年10月15日",
    "title": "Relax",
    "content": "Take the time to enjoy this space in the middle of Shanghai. Great place to just sit down and forget you are in such a bustling city.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "536rhondam",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月15日",
    "title": "Must see!",
    "content": "Yuyuan Gardens is a must-see spot in Shanghai. The garden itself can be quite crowded, so if you can do a week day excursion, you won’t be sorry. When it’s not crowded, it is a serene gem in the heart of the city. The surrounding buildings & markets are bustling- and although they are only replicas of ancient buildings, the atmosphere is undeniably charming. Be brave- the vendors can be quite assertive & personal space is non-existent- but you can find countless treasures & popular street food, if you are game to elbow in among the locals. If you are so fortunate to visit during Chinese New Year, the Lantern Festival is stunning!",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "sondraw221",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月14日",
    "title": "Old School China",
    "content": "This is the old town of Shanghai. The structures are exactly what you would expect old structures in China to look like. There are some nice walkways, ticky tack shops, and tourist restaurants. It is worth a short visit, but be prepared for the crowds!",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "YOY1",
    "user_loc": "新墨西哥Placitas",
    "bubble": "40",
    "add_time": "2018年10月12日",
    "title": "A beautiful must visit in Shanghai",
    "content": "Yuyuan (Yu Gardens) date back to the Ming Dynasty (16th Century). They city of Shanghai has grown up around it, but the 5 acre gardens are an oasis unto themselves, quite hidden away from the city right outside its walls. I visited during a national Chinese holiday week and while the garden was crowded with visitors, it still maintained a sense of serenity. Strolling the paths from buliding to building evoked a different time and place. I would definitely return.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "egarnier1",
    "user_loc": "法国吕埃—玛尔梅松",
    "bubble": "40",
    "add_time": "2018年10月12日",
    "title": "Very nice garden",
    "content": "This garden is worth a visit when you are in Shanghai. The buildings are well preserved with nice furniture and the atmosphere is quiet and peaceful. Not as nice as the Suzhou gardens though.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "fortonbear",
    "user_loc": "英国斯特劳德",
    "bubble": "50",
    "add_time": "2018年10月12日",
    "title": "A must see",
    "content": "Great architecture and history. Beautiful gardens and fish pools complete with very large koi carp. Despite being quite crowded, very relaxing place to visit. Also, it's free!!",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Wilyfox68",
    "user_loc": "澳大利亚布里斯班",
    "bubble": "50",
    "add_time": "2018年10月11日",
    "title": "Magnificent Garden",
    "content": "This was our favourite sight on our trip to Shanghai partly as we didn't know what to expect. Nestled in Old Shanghai you have little clue from the outside just how fabulous each part of this garden is. Highly recommended!",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "MarciMG",
    "user_loc": "澳大利亚堪培拉",
    "bubble": "40",
    "add_time": "2018年10月9日",
    "title": "Peaceful Garden",
    "content": "This is a lovely garden which is nice and peaceful. It is a joy to walk around and admire the gardens or just sit and enjoy the atmosphere.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "ClarissaC429",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月27日",
    "title": "Nice old buildings",
    "content": "The buildings around are very antique and good place to take photos. There are several eateries and place to buy souvenirs.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/2b/4c/be/20181023-111453-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/2b/4c/bf/20181023-112034-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/2b/4c/ba/img-20181023-110145-047.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/2b/4c/b7/20181023-105159-largejpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "676ginak",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月26日",
    "title": "Worth your time to visit ",
    "content": "On a recent business trip to Shanghai we took a day to tour the city since it was the first time for most of us. We asked our concierge to pick an English tour operator and Cindy was great. They are a small private tour guide in a mini van and not sure the name of company but we stayed at the Hyatt on the Bund. Cindy only does private small groups. We let her tell us what we were seeing and we’re very happy with the tour. We felt Yu Gardens was the highlight because you were in the city but felt like you were transported to another time. The Gardens are over 450 years old and we’re made to look like they are 1000 years old. They did a great job. They added to it in recent years to look like the aged gardens were always there. The buildings and pagodas and landscaping were beautiful. I highly recommend this area for a visit and stop to visit the kiosks along the way to buy unique musical instruments or in the gardens they have some made of china and sell vases and other unique pottery and Jewlery. Don’t miss the tea house near by. ",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/29/51/e5/photo5jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/29/51/e7/photo7jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/29/51/e2/photo3jpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/29/51/e9/photo9jpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Dodger52",
    "user_loc": "澳大利亚卧龙岗市",
    "bubble": "50",
    "add_time": "2018年10月9日",
    "title": "Very Peaceful",
    "content": "This garden is well protected from the hurley burley around it by large walls. It is well laid out and very ornate. The crowds make it a bit of a challenge, but well worth a visit",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "N6041QHdavids",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月8日",
    "title": "Crowded ",
    "content": "These gardens are in the old quarter of the city so just getting to them is a fun experience passing all the shops stalks and fast food outlets. The gardens are inexpensive and even cheaper if you are over 60 like me. The big problem is their popularity. There are loads of tour groups but also the tour group leaders will send their party in and wait for them to emerge. So the best time to see the gardens is either very early or late in the afternoon when all the tour groups have gone. As for the garden it is a maze of paths through buildings and rocks over bridges that span waterways. Its a Chinese garden so not many flowers and not a blade of grass. There are koi carp to feed and an exhibition of Chinese art. There is also a shop selling paintings but as soon as you enter you will be followed by a rep eager to sell you a painting. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "erdncksdl",
    "user_loc": "土耳其布尔萨",
    "bubble": "50",
    "add_time": "2018年10月8日",
    "title": "Wonderful place",
    "content": "End of 2016 I stayed in Shangai and also visited Yu Garden. There was very historical buildings and good athmosfere. You can buy lots of things for a gift. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "christasty",
    "user_loc": "澳大利亚珀斯",
    "bubble": "40",
    "add_time": "2018年10月7日",
    "title": "Busy",
    "content": "So busy...",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "suepardesshanna",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月6日",
    "title": "Most beautiful garden",
    "content": "Wonderful garden in Shanghai; Very extensive with different areas; grottos, dragon sculptures, fish ponds, like a massive maze - go with a guide who knows the way !",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "davidmM1261JK",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月6日",
    "title": "Beautiful recitation of old China ",
    "content": "While it’s obviously a recreation and a “tourist trap” with overpriced souvenirs it is also absolutely beautiful and a must see, you can see recreations of ancient architecture and taste local snacks. Don’t forget to finish the tour with a visit of the temple at the end of the street.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "684yaronb",
    "user_loc": "以色列海法区",
    "bubble": "40",
    "add_time": "2018年10月4日",
    "title": "Very nice",
    "content": "The place is nice and quit, with some good relaxing corners. Recommended for relaxing and enjoying a nice garden.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "KentuckyDerbyGirl270",
    "user_loc": "肯塔基Brandenburg",
    "bubble": "40",
    "add_time": "2018年10月4日",
    "title": "Beautiful Garden ",
    "content": "We visited as a family and found the self-guided tour delightful! Entrance was a bit frantic, perhaps because we visited during Golden Week and didn’t realize we still had to wait in the ticket line even though we had purchased tickets online. While we didn’t find it peaceful, we loved the architecture, water gardens and plants! Overall, a delightful way to spend the morning!",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "renesio",
    "user_loc": "菲律宾马尼拉",
    "bubble": "50",
    "add_time": "2018年10月4日",
    "title": "Peaceful and Restful",
    "content": "Our ladies loved the small garden because it was so peaceful in the middle of the Yuyuan Market. Old house and gardens serve a restful stop.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Star-Monar",
    "user_loc": "",
    "bubble": "20",
    "add_time": "2018年10月22日",
    "title": "Overrated, overcrowded tourist trap",
    "content": "Maybe we were spoilt after two weeks of exploring historic sights in this stunning country, but we couldn't wait to get away from this place. Crowded full of tourists, sellers chasing you and harassing you to buy their fake merchandise and overpriced tacky rubbish... Not for me! The buildings are beautiful and the central square with the fountains and zig zag bridge is well worth a look but other than that steer well clear. Not worth paying to get into the garden either, really overcrowded even on a weekday and pretty underwhelming compared to many other gardens in China. Once you've seen the first courtyard with fish ponds you've seen it all, just more and more of the same.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/20/78/e1/20181012-112644-largejpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "gurbindern2016",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月21日",
    "title": "Worth visiting atleast once",
    "content": "Arrive there in the morning when the garden opens. Price is 40 yuan for one adult. I went at 9am to avoid the rush and even then there was quite a few tour groups. Not a problem if you want to get isolated shots since many of these tour groups move slowly and you can easily just start from the middle. The park covers a small area but because it can be complex, it is tight and can be confusing to navigate. However, it will take possibly more than 2 hours to see everything. I spent an hour and a half and I was going through the garden at a fast pace. Definitely worth a visit. ",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-f/15/1c/9e/9a/img-20181020-092917172.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/1c/9e/98/img-20181020-092257658.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/1c/9e/97/img-20181020-092114922.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/1c/9e/99/img-20181020-092602723.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "davewT6700VR",
    "user_loc": "英国格兰瑟姆",
    "bubble": "50",
    "add_time": "2018年10月3日",
    "title": "Beautiful place to visit",
    "content": "These gardens are not really gardens in the real sence of the word but are well worth a visit. The zig zag bridge is fantasic with all the carp in the ponds below. The buildings are in really old chinese stile and the history is very interesting especially the dragon wall.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "cherylchin",
    "user_loc": "佛罗里达迈阿密",
    "bubble": "40",
    "add_time": "2018年10月3日",
    "title": "Very nice place to visit",
    "content": "Definitely enjoyed these gardens. Very peaceful and relaxing. Wasn't very crowded when we got there Loved the busy shopping area around it. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "marsamchar",
    "user_loc": "英国滨海韦斯顿",
    "bubble": "40",
    "add_time": "2018年10月3日",
    "title": "beautiful",
    "content": "Very calm place with all the symbolism of china: rock and water, zig zag pathways. Not big but easy to lose yourself in its placidity. Watch out for dragons on top of the walls!",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "letsseetheworldnow",
    "user_loc": "新加坡新加坡",
    "bubble": "30",
    "add_time": "2018年10月2日",
    "title": "A bit meh if you ask me",
    "content": "I've heard great things about the garden, but unfortunately, I left feeling underwhelmed. One of the reasons was probably because it was rather crowded when I visited. There are touristy stores outside of the garden if you're looking to buy souvenirs. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "GlennGoh",
    "user_loc": "澳大利亚悉尼",
    "bubble": "50",
    "add_time": "2018年10月2日",
    "title": "A Hidden Surprise in modern Shanghai",
    "content": "A must visit to this few hundred years old building when in Shanghai. It is so well preserved and have so many beautiful gardens. Visitors are treated to the various unique collection of rocks and a fabulous dragon sculpture on top of the wall. Some of the old furnitures are still there (not sure if they're restored ones) but they give us a good glimpse of what's life like in those days. Outside, there are abundant old building structures (mostly tea houses) that represent olden times and they are so elegant. Shopping here is fantastic but you need to bargain hard.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "rebeccagF5764HZ",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月2日",
    "title": "Lovely Gardens",
    "content": "If you are in Shanghai, you definitely want to allow time to visit Yu Garden. We went during school holidays so it was very busy, but if you can, try for a quieter time. It takes a few hours to go through the whole complex as there quite a few little trails off the main track and it is worthwhile exploring them. Make sure you have your walking shoes on. There are many beautiful places to stop for rest if you want to. Do take a bottle of water with you, but if not there is a tea house in the middle of the gardens. Once you exit the main gardens but still inside the main complex there are quite a few gift shops that are also worthwhile exploring. I purchased 2 paintings by a very gifted artist, painted entirely using the hand (no brush). After exiting into the street, there are many shops offering clothing and souvenirs but we elected to go into one of the first shops on our right and upstairs into the most quaint and peaceful little tea house, where the lady working there educated us on all things tea and made us the most delightful iced tea, using dragon tea and osmanthus tea. Very restful after a crowded place and refreshing in the hot weather. Definitely a worthwhile visit!",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "MarkO2798",
    "user_loc": "",
    "bubble": "40",
    "add_time": "2018年10月1日",
    "title": "Nice architecture and relaxed environment.",
    "content": "A pleasant way to spend an hour or two. Pick your time to go as it was busy when we were there. lots of secret pathways through rock formations.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "traveller77722",
    "user_loc": "澳大利亚希望岛",
    "bubble": "40",
    "add_time": "2018年10月1日",
    "title": "Hard to find",
    "content": "We took ages looking for the gardens and the queues to get in once we found it were so long. Nice gardens though but not botanical. Little areas of pretty ponds and serene spots, worth a visit though. ",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "KVS79",
    "user_loc": "英国南安普敦",
    "bubble": "40",
    "add_time": "2018年10月16日",
    "title": "Go Early",
    "content": "This is a lovely place to visit just off The Bund thoroughly recommend a visit but enjoy it before the crowds get to big. Then explore the shopping area that offers everything you can imagine and more. Very much old and new China.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-s/15/10/65/11/yu-garden-yuyuan.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/10/66/18/yu-garden-yuyuan.jpg",
      "https://ccm.ddcdn.com/ext/photo-s/15/10/65/90/yu-garden-yuyuan.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "rochesterrambler",
    "user_loc": "英国罗契斯特",
    "bubble": "50",
    "add_time": "2018年10月17日",
    "title": "Delightful Garden",
    "content": "It must be said, that this is much more than just 'a garden'. Yes, there are trees and flowers but the buildings and water features etc. add an awful lot more to the experience of your visit.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-f/15/12/8f/eb/yuyuan-gardens.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/12/8f/fa/yuyuan-gardens.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/12/90/0b/yuyuan-gardens.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "ElPasoMaker",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年10月16日",
    "title": "Best picture opportunity in town",
    "content": "It's a small garden but it is truly wonderful especially for photo Ops and then you have some really meet shopping close cry not the typical trinkits but actually more artistic stuff is also available in dusk had crowded in the afternoon so an early on morning visit or late evening would be best.",
    "image_urls": [
      "https://ccm.ddcdn.com/ext/photo-f/15/10/c8/93/20181010-092415-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/10/c8/92/20181010-093451-largejpg.jpg",
      "https://ccm.ddcdn.com/ext/photo-f/15/10/c8/91/20181010-095331-largejpg.jpg"
    ],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "CantBeBothered18",
    "user_loc": "澳大利亚阿德莱德",
    "bubble": "40",
    "add_time": "2018年10月1日",
    "title": "Peace in metropolis city",
    "content": "The Yu garden provides tranquility in a busy city.  The architecture was interesting with plenty of examples of feng-shui incorporated.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "Demig_AIUK",
    "user_loc": "英国莫佩思",
    "bubble": "40",
    "add_time": "2018年9月30日",
    "title": "Very business",
    "content": "A nice place but madly busy, worth a visit though. A little tip if you want to have tea is ignore the famous tea room on the bridge as you can go into one through a shop just outside the paid entry bit and sit on the balcony there and take tea whilst watching the world go by and it’s surprisingly quiet after the crowds. Look for a neon sign saying beer and tea at the back of a shop with a balcony.",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  {
    "username": "DrKatieRN",
    "user_loc": "",
    "bubble": "50",
    "add_time": "2018年9月30日",
    "title": "Great shopping and historical landmark",
    "content": "I come to Yu Garden every time I visit Shanghai. This is my 6th visit. There are beautiful gardens. Seniors get half price. The surrounding streets are teeming with great shopping, everything from fine jewelry, to contemporary Chinese dresses, and traditional Chinese attire. Lots of great restaurants. We enjoyed Starbucks and dumplings for lunch!",
    "image_urls": [],
    "language": "en",
    "images": [],
    "image_paths": []
  },
  [
    {
      "username": "sleighcampbell",
      "user_loc": "俄勒冈本德",
      "bubble": "50",
      "add_time": "2018年11月15日",
      "title": "Great garden ",
      "content": "This is a 2000 year old garden that is kind of a maze. It is worth the small entrance fee charged. It is located in the middle of old Shanghai and you really don’t need a guide.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Voyager811386",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年11月14日",
      "title": "Tourist Magnet",
      "content": "This area was really busy at the weekend, but quieter early on a weekday. We made a return visit in order to look properly at the buildings. They are very authentic and you would think they were really old rather than relatively recent constructions.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "elizabethbA6LC",
      "user_loc": "英国泰晤士河畔金斯敦",
      "bubble": "50",
      "add_time": "2018年11月13日",
      "title": "Afternoon excursion.",
      "content": "This exquisite garden is a window on the past. The buildings are exquisite and there are various nooks and crannies throughout. It is a restful, peaceful place well worth a visit.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "EBY_NYC",
      "user_loc": "纽约州纽约市",
      "bubble": "40",
      "add_time": "2018年11月13日",
      "title": "Crowded",
      "content": "We visited during Golden Week, and got to enjoy the crush of every time being on vacation along with the local tourists. Went for very pricy tea in a teashop above the garden. It was a nice break for all the hustle and bustle down below.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Reklaw252",
      "user_loc": "加拿大Battleford",
      "bubble": "50",
      "add_time": "2018年11月12日",
      "title": "Breath taking and enchanting",
      "content": "This is one of the highlights of a two week tour of \"important\" sites we visited over a period of two weeks.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "cateoharea",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年11月12日",
      "title": "Fantastic at night with lights",
      "content": "Wonderfully lit up and beautiful place to visit and roam. It is crowded but I didn't mind the crowds since it was so visually stimulating.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Tilliclax",
      "user_loc": "瑞士莫尔日",
      "bubble": "50",
      "add_time": "2018年11月12日",
      "title": "Delightfully Unexpected !",
      "content": "If you've got a couple of hours to spare in Shanghai, then a visit to this spectacular formal 16th century garden is a must. Yes, it's busy, but try to find a 'quiet' time (early morning) and enjoy the architectural styles which will take you back a couple of hundred years .... A real flavour of Old China.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "KTMTravelBites",
      "user_loc": "澳大利亚布里斯班",
      "bubble": "40",
      "add_time": "2018年11月11日",
      "title": "Shanghai Yu Garden (Yuyuan) Is Very Beautiful But Crowded",
      "content": "The Yu Garden in Shanghai is simply beautiful with so much history to take in. I would recommend to go first thing in the morning as I would say this is when you would see it at its best (without the crowds - we found a lot of them are very pushy). It would be amazing to be able to take in the serenity of the gardens, pagodas etc and really enjoy the ambience - and get great photos without too many people in them! It is worth visiting, but go early to make the most of it.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "walkinthewoods",
      "user_loc": "华盛顿西雅图",
      "bubble": "50",
      "add_time": "2018年11月10日",
      "title": "The Gardens are great",
      "content": "Enjoyed the gardens very much and they themselves are worth a trip there. The rest of the area apparently was all recreated in an old town chinese style and is loaded with shops and restaurants. Very interesting to walk through and experience. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "SueJim126",
      "user_loc": "英国谢菲尔德",
      "bubble": "50",
      "add_time": "2018年11月10日",
      "title": "Only surviving Ming Dynasty Garden in Shanghai",
      "content": "Exquisite garden, decorated bridges, colorful pagodas and intimate enclaves separated by \"dragon walls\" — partitions with dragon decorations on top and the Jade Rock, said to have been one of Song Emperor Huizong's private collection. Crowded but well worth a visit.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "iloond",
      "user_loc": "菲律宾长滩岛",
      "bubble": "40",
      "add_time": "2018年11月10日",
      "title": "Nice but crowded",
      "content": "Interesting place to visit but very crowded. Nice to see but didn't spend a long time in the garden.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "michaelpG9255BM",
      "user_loc": "澳大利亚悉尼",
      "bubble": "40",
      "add_time": "2018年11月8日",
      "title": "Intresting Complex",
      "content": "The area is very interesting and there is a nice, short walk on the bridge across the small lake. BUT go early as it gets very crowded as the day goes on.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "817nehap",
      "user_loc": "印度新德里",
      "bubble": "40",
      "add_time": "2018年11月6日",
      "title": "Very very busy",
      "content": "The area around the Yu Garden is beautiful and so full of people. There are so many shops especially for Shanghai local cuisines. Candy shops and Chinese handicrafts shop. I really liked the marker area around the Yu Garden more. The ticketed entrance was 40 yuan each and was not worth it.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "BrettH53",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年11月5日",
      "title": "Tourist",
      "content": "Nice to have a walk around. A respite from busy Shanghai. Great for photos. Spent about 30-40 minutes",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "MCB6568",
      "user_loc": "加拿大蒙特利尔",
      "bubble": "30",
      "add_time": "2018年11月5日",
      "title": "Nice but be prepared for the crowd!",
      "content": "Its an impressive « familly » house. Lovely gardens in the very middle of the City! Most living space similar to my none specialized eyes... but the crowds are taking away from the peace of mind one should enjoy in this place..",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "skp288",
      "user_loc": "新加坡新加坡",
      "bubble": "10",
      "add_time": "2018年11月4日",
      "title": "Not worth going",
      "content": "Supposedly a historical site with an ancient temple (closed at the early hour of 4.30 pm). In actual fact there’s nothing there except shops. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Trail757654",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年11月4日",
      "title": "Amazing history.",
      "content": "Yuyuan Gardens are amazing. The old culture and history is gives the garden a unique apparel. It's a peaceful escape from the crazy busy sights and sounds of the city. I read about it in a travel book and I listed it at the top of my list of things to do in Shanghai and it did not disappoint me. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "ESTEVEA",
      "user_loc": "加利福尼亚圣罗莎",
      "bubble": "50",
      "add_time": "2018年11月2日",
      "title": "A must see and experience while in Shanghai",
      "content": "Do not miss this Garden and Bazaar !!! So much fun. First the gardens and all the koi are amazing. There are views from every direction. Just wander about and you will be thrilled. Eveyone is taking photos of everyone. Then there is the Bazaar which surrounds the gardens. Everything you could ever want in items is here for you. Even explore the upper levels and there is even more for you to buy, buy, buy !!! Everything from Nike to ancient jade. Just keep exploring. Leave plenty of time for you to explore and have lunch or dinner.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "isa_perth",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年11月2日",
      "title": "Must see",
      "content": "Beautiful gardens and temple well worth visiting, amazingly crowded. We were with a tour guide who explained many details we would otherwise have missed.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "elvin2018",
      "user_loc": "印度孟买",
      "bubble": "40",
      "add_time": "2018年11月2日",
      "title": "An Unusual Attraction",
      "content": "A visit to the Yuyuan garden is a different experience. One has to meander through a few lanes with typical Chinese architecture buildings of a bygone era that is a busy and colourful market today, selling souvenirs, food, fashion. boutiques etc. until you come to a bridge that has a few left and right turns that take you to the entrance of this garden. The bridge itself is a fun place with lots of things in the water below: small isles with pretty plants, fish, ducks etc and people throng here to take pictures/selfies etc. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "alstrchm",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年11月2日",
      "title": "Crowded",
      "content": "Beautiful garden with antique items from Ming Dynasty. There are food stalls and souvenir shops outside. Overall, place is picture-worthy but overcrowded",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "bookwormt",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年11月1日",
      "title": "Beautiful Chinese garden",
      "content": "It is actually 3 major attractions here: garden temple and market.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Bellechasse10",
      "user_loc": "俄亥俄阿克伦",
      "bubble": "50",
      "add_time": "2018年10月31日",
      "title": "Beautiful, but crowded",
      "content": "I visited this garden thirty years ago when it was a much more impressive and pleasant experience. Now the garden is buried and hidden in a huge crowded bazaar / shopping area. There are no clear signs to the garden entrance, I had to ask several tourists. The approach to the garden has this lovely bridge, but it was black with noisy people. I enjoyed the stylish beautiful old garden, the buildings, rocks, carvings, views. Go, enjoy.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "PaulBlundell",
      "user_loc": "英国沃尔夫汉普顿",
      "bubble": "50",
      "add_time": "2018年10月31日",
      "title": "Beautiful a must to see",
      "content": "Very beautiful area. Very old traditional styled houses and tea house (tea house very expensive). Gets very busy around this area and to walk across the pathways that bridge over the water. Spend time feeding the koi carp, they are huge! Lovely shopping, maybe a little more expensive as its very touristy but lovely to spend some time. Try some bubble tea. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "cricketfanBB",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月31日",
      "title": "Classic garden",
      "content": "But very crowded. Too many tourist shops inside. But some really good buildings and sights. Probably worthwhile going with a guide",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "dolphint2017",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月31日",
      "title": "Good place to visit",
      "content": "it's my favourite place for visiting. You can enjoy to see many things like clothes, toy, food, souvenir, etc. You can visit temple nearby. Don't miss to visit this place if you come to Shanghai.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "rottrek",
      "user_loc": "捷克共和国布拉格",
      "bubble": "50",
      "add_time": "2018年11月15日",
      "title": "Another place Must see",
      "content": "Pleasant place in the middle of a modern and vibrant city. In gardens with breathtaking atmosphere to relax, gather new energy. The tour is about 1 hour if you do not hurry anywhere. Admission approximately 5 €.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-f/15/62/9c/d3/yu-garden-shanghai.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "greatcanadiantea",
      "user_loc": "加拿大蒙特利尔",
      "bubble": "50",
      "add_time": "2018年11月14日",
      "title": "Must visit place in Shanghai ",
      "content": "Classic Chinese garden with beautiful architecture. Unique zigzag bridge with lots of fish in the pond. Many craft shops and local restaurants. The famous soup dumpling was originally from one of the restaurants there. There is a very cute Chinese tea house located in the middle of the pond looks like a big gazebo. All rosewood Chinese style furniture, they have different types of tea selections; and even visited by Queen Elizabeth II in the 1980’s. This is a must visit in Shanghai.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/5e/ca/03/photo0jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/5e/ca/06/photo3jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/5e/ca/07/photo4jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/5e/ca/0d/photo9jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "aditip900",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年11月15日",
      "title": "Yu garden visit",
      "content": "Been there with my friends in winters in February.Nice place to have a look around with various food shops and shopping street around....Yu gardern is beautiful.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/62/17/d0/img-20170209-wa0002-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/62/17/d1/img-20170209-wa0003-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/62/17/d3/img-20170209-wa0054-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/62/17/d2/img-20170209-wa0053-largejpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "anarchius",
      "user_loc": "威斯康星沃基肖",
      "bubble": "40",
      "add_time": "2018年11月13日",
      "title": "An unending maze",
      "content": "This place is fun. Getting there can be tricky and rather crowded (there is a single doglegged bridge you need to cross), but once you are inside the crowds (relatively) thin out. The place is massive, beautiful and interesting. Without a lot of direction or signage, you basically stroll along, finding forks in the roads, taking them and trying to imagine what the other road would be like. There are bridges, tunnels, rooms, buildings, gardens, ponds (with Koi), deadends, rock sculptures, bonsai's and water jade. Basically an explosion of sights all strung together in a surprisingly cosy yet extensive location.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-f/15/5d/d2/53/the-garden.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/5d/d2/17/the-garden.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "JuWhit",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月31日",
      "title": "Get clear directions before you set off",
      "content": "Had huge trouble finding this - met half a dozen people in the same situation (including a Chinese tourist). When we got to the entrance, I wasn’t sure why it was so difficult. I think we got caught up in the alleyways around beforehand. We went on a Sunday and it was very busy. Not sure it would be different on another day. It is beautiful and worth visiting. If you don’t get to Suzhou, I think this is an excellent alternative. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "WorldTravler1946",
      "user_loc": "加利福尼亚洛杉矶",
      "bubble": "30",
      "add_time": "2018年10月30日",
      "title": "Too commercial",
      "content": "We were here about 12 years ago and now it is very commercial. So many vendors selling the same things. It was such a pretty place before.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "514fatouz",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月29日",
      "title": "To discover",
      "content": "Please do not limit yourself by staying on the first Street. Go further in the market as you will be able to see some of the greatest Chinese architecture.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "G6426FManthonys",
      "user_loc": "澳大利亚布里斯班",
      "bubble": "40",
      "add_time": "2018年10月29日",
      "title": "Oasis in the city",
      "content": "Ver6 pleasant garden in the city where the sounds of the city don’t seem to penetrate. Lovely old gardens and buildings interspersed with ancient walls and moon gates.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "wmk168",
      "user_loc": "",
      "bubble": "30",
      "add_time": "2018年10月29日",
      "title": "Tasteless food",
      "content": "The food in foodcourt near gate 7 is tasteless and expensive. Floor is dirty and oily. Souvenirs has to be bargained carefully. It is a lot more higher that outside. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "greynomad101",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月29日",
      "title": "Yu Gardens A Calm Oasis",
      "content": "WE did this tour as part of a 14 day tour organised by Top China Travel.. Our guide in Shanghai was Leo. He took us to Yu Gardens and adjoining market as part of our Shanghai Tour. This area is really worth visiting and is close and convenient to other major tourism sites. He is energetic, passionate and we all quickly became friends. Our driver was Mr Wong who beyond expectations to ensure our travels were safe and enjoyable, including making sure we got to the airport in plenty of time for our flight",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Sourabh-Joshi-INDIA",
      "user_loc": "印度新孟买",
      "bubble": "50",
      "add_time": "2018年10月29日",
      "title": "Yu Garden is Stunning!",
      "content": "This is the major stop when in Hop in Hop off bus tour. It does not disappoint you in any manner. It is beautiful. Though its very crowdy but its really stunning. You will feel awesome here. Also, you can have a lot of shopping in old town area.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "836fayen",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月29日",
      "title": "A must visit at night!",
      "content": "A must visit at night! It's a bit crowded but let's do it for the 'gram.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "robertsY6172QZ",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月28日",
      "title": "A nice oasis in the middle of Shanghai",
      "content": "We accidentally came across the gardens in a shopping area and rather that spend time in shops we spent the time in the gardens and thorough enjoyed the peace and serenity. It was a very nice break from the commercialism.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "laj2e7",
      "user_loc": "佛罗里达奥兰多",
      "bubble": "40",
      "add_time": "2018年11月12日",
      "title": "Beautiful garden and home",
      "content": "This is a great example of the home gardens . There are dragons in the architecture . This a fun way to spend an hour or 2. There is a fee to enter the gardens . I would recommend a tour guide to explain what you are looking at . There are coy ponds throughout the gardens . The terrain is a little rocky and can be slippery when wet . The contrast with the old and new was also visible here. There are examples of weapons and coins . ",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/57/f3/0a/photo1jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/57/f3/0c/photo2jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/57/f3/0d/photo3jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/57/f3/08/photo0jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "cwtraveller2017",
      "user_loc": "密歇根安娜堡",
      "bubble": "50",
      "add_time": "2018年11月11日",
      "title": "Great shopping entertainment and culture",
      "content": "Takes 3 visits to see it. The day visit for the narrow market streets and the zigzag bridge. The Visit to the actual ancient gardens - for peace and tranquility in the middle of downtown Shanghai. And finally the night visit - to see it lit up - spectacular!",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/53/dc/4a/photo1jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/53/dc/49/photo0jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "448marcom448",
      "user_loc": "墨西哥Celaya",
      "bubble": "50",
      "add_time": "2018年11月8日",
      "title": "So beautiful!",
      "content": "In the heart of Shanghai, something you must see! Near to the bund, totally worth it. Great garden, and history.",
      "image_urls": [
        "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
        "https://ccm.ddcdn.com/ext/photo-s/15/4a/ae/86/img-20181028-114530415.jpg",
        "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
        "https://ccm.ddcdn.com/ext/photo-s/15/4a/ae/87/img-20181028-114450983.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "susimaBeirut",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年11月10日",
      "title": "Old vintage garden beautiful to see",
      "content": "Beautiful garden ",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/52/76/64/photo0jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "ggold123",
      "user_loc": "上海市",
      "bubble": "50",
      "add_time": "2018年11月12日",
      "title": "The Lantern Festival at Chinese New Year is a must!",
      "content": "If you're lucky enough to visit Shanghai during Chinese New Year, you must visit Yu Garden to see the Lantern Festival. it is a spectacular display, not just of lanterns, but giant lit dioramas laid out in succession as you follow a path through the ponds. It can get crazy crowded and you need to buy a ticket, but it's worth it. And while you're there, there's lots of shopping and food nearby. The soup dumplings that are served with a straw and the amazing Shanghai dumplings that are fried on the bottom and steamed on the top are a must! So delicious.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/56/e6/b3/chinese-new-year-lantern.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/56/f5/77/chinese-new-year-lantern.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/56/f8/13/shanghai-dumplings-up.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/56/f3/da/chinese-new-year-lantern.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Ptuji",
      "user_loc": "英国伦敦",
      "bubble": "50",
      "add_time": "2018年10月28日",
      "title": "Stunning",
      "content": "Busy but peaceful if you know what I mean. Very old trees well laid out and historical. Go early. Access via old town so you can shop afterwards ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "betteskid",
      "user_loc": "马萨诸塞波士顿",
      "bubble": "40",
      "add_time": "2018年10月28日",
      "title": "Very nice garden - but can be a bit crowded",
      "content": "I visited here on a weekday afternoon and enjoyed the garden. It is quite large and the leaves were just beginning to turn when I was there. The garden is also near a large market, making it easy to do some shopping after you have seen the garden. The various ponds and buildings are all well-maintained. I would have preferred a visit when there were fewer people, but it is a major attraction, so perhaps arriving at the start of the day would be better.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "vegasrugbyref",
      "user_loc": "内华达拉斯维加斯",
      "bubble": "50",
      "add_time": "2018年10月28日",
      "title": "Chinese Garden ",
      "content": "Another must do when visiting Shanghai. Located in the mainland side of the Bund area. EASILY a few hours of good free excursion. Traditional Chinese culture and garden. Busy in afternoons. Food in area. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "CraigandDiS",
      "user_loc": "新西兰惠灵顿",
      "bubble": "50",
      "add_time": "2018年10月27日",
      "title": "Magic",
      "content": "With the crowds outside and the queues, I anticipated a chaotic scene inside this favourite garden. But no, the garden just seems to absorb the crowds into its many tranquil rooms. A beautiful, contemplative place. Don’t be put off by the hustle and bustle outside.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "petercot",
      "user_loc": "英国剑桥",
      "bubble": "40",
      "add_time": "2018年10月26日",
      "title": "Picturesque but crowded ",
      "content": "Set in middle of shopping streets, provides a bit of an oasis. But it is crowded. Small lakes are stuffed with large fish. Some interesting plants",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "StephenGlobeTrotter",
      "user_loc": "英国阿什伯恩",
      "bubble": "40",
      "add_time": "2018年10月24日",
      "title": "Beautiful gardens dating from 1559",
      "content": "This is a classic tourist stop in the Shanghai Old Town, and we highly recommend to you. We’d suggest hire a guide to get the best overall experience and to learn the meanings of each feature - building, inscription, floor surface, etc.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "dhanatthat",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月24日",
      "title": "Very crowded.",
      "content": "I came here a couple times and every time I visited the crowds never go away! I like to come here for the famous xiao long bao. There is an old tea house located right in the middle of the garden. It’s quite nice with the small olden tables and chairs.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "sereneloh2018",
      "user_loc": "新加坡新加坡",
      "bubble": "30",
      "add_time": "2018年10月23日",
      "title": "Crowded tourist & historical building",
      "content": "Walking distance to & fro Metro. Crowded full of tourists, Old man / Lady chasing you to buy their fake merchandise such as handbag and watches...Freelance Tour guide (Maybe) question mark for me?? approaching & asking to try on their freelance tour services. Just don't bother, overall they wont harm you. DO take note, bring more cash with you, no money changer. You might need to search for bank and will need to pay an extra charge of RMB50 per transaction (This only applicable for certain bank (have no ideal why they have such rules). Overall i enjoyed the scenery, shopping for local products and can try to asked for bargaining good deal and The historical buildings are beautiful & Charm.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Athenry72",
      "user_loc": "爱尔兰戈尔韦",
      "bubble": "50",
      "add_time": "2018年11月4日",
      "title": "Night visit to yu garden and markets",
      "content": "We went to the yu garden and markets as part of our tourist experience. Lovely relaxed market but be prepared to bargain hard for any purchases. Treat this as a bit of fun and don't take any offence with some bargaining attitude. Lots to choose from for all your touristy purchases. The tea House is a lovely traditional building with surrounding pond full of large koi and ducks. Overall its a nice way to spend a few hours some evening, definitely recommend it. Excuse the poor pics... ",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/3e/1a/51/dsc-2944-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/3e/1a/4f/dsc-2952-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/3e/1a/50/dsc-2951-largejpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "heidil290",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年11月4日",
      "title": "Very interesting wholesale market and sightseeing spot!!!!",
      "content": "Yu Garden was built in the 15th century and is now a tourist sightseeing spot in Shanghai. There is an old garden as well as surrounding area with local craft works, jade/jewelries, souvenir shops, wholesale markets, local food and restaurants, etc.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/3e/da/16/photo0jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/3e/da/1c/photo5jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/3e/da/17/photo1jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/3e/da/18/photo2jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "TAMAN1951",
      "user_loc": "华盛顿Liberty Lake",
      "bubble": "50",
      "add_time": "2018年11月3日",
      "title": "Lovely grounds",
      "content": "Wonderful visit. ",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/3c/56/a1/photo0jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/3c/56/a2/photo1jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/3c/56/a5/photo4jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "698michelley",
      "user_loc": "香港",
      "bubble": "40",
      "add_time": "2018年10月22日",
      "title": "Nice visit",
      "content": "It's very beautiful with it's historical buildings.  Quite crowded with tourists though.  Still worth a visit.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "516sushantm",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月22日",
      "title": "Excellent place, must see",
      "content": "Enjoyed both the garden. Friends and family enjoyed the shopping (and bargaining too), we came back to shopping next day",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "313ramyw",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月22日",
      "title": "Oh my God ! This district is a piece of art ",
      "content": "This is a must see.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "CaptainAndSparrow",
      "user_loc": "德国柏林",
      "bubble": "40",
      "add_time": "2018年10月22日",
      "title": "Very nice parc",
      "content": "Very nice location to spend some time and relax after the crowded inner city of shanghai. after 30 minutes there is not really something new to discover but the place is worth a visit",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "DMiz",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月21日",
      "title": "A must See in Shanghai",
      "content": "Wow! this place is really cool for an authentic slice of old Shanghai. We went on a Sunday and it is crazy busy, but well worth it. The gardens and buildings are spectacular. There is a small fee to enter - but just do it, you won't regret it. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "968mitchi",
      "user_loc": "英国伦敦",
      "bubble": "50",
      "add_time": "2018年10月21日",
      "title": "Amazing gardens but very busy",
      "content": "The gardens here in Shanghai are lovely. They are huge and very well taken care of. This is why there is a small entrance free of around £4. The downside is it's very busy here so it is not a garden where you can sit and relax. As soon as you leave the garden their are a million tourist stalls all trying to sell you things which also annoying.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Deb3John",
      "user_loc": "澳大利亚卡拉萨",
      "bubble": "50",
      "add_time": "2018年10月21日",
      "title": "Busy Busy Busy",
      "content": "Go early or late - this place gets busy fast. But it was worth going it gives you an appreciation of Chiese art of garden scaping. It is extremely popular on the weekends",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "36torb",
      "user_loc": "挪威Strandebarm",
      "bubble": "30",
      "add_time": "2018年10月19日",
      "title": "There are much better parks in China",
      "content": "We went here as part of a tour,and we was dissapointed ,the gardens are extremely busy with huge crowds of people. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "sarahu1981",
      "user_loc": "新西兰惠灵顿",
      "bubble": "40",
      "add_time": "2018年11月2日",
      "title": "Locelu",
      "content": "The area of Yuyuan gardens is easy to get to as it’s a stop on the metro. Actually getting in to the gardens was hard. When you walk out of the metro and get to the Main Street, you need to walk in to the centre of the shopping area. Once in there, follow the signposts. You’ll walk across some bridges over the water and past the famous tea house. Keep walking around the path and you’ll finally come to the ticket office. Then you can enter the actual gardens.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/39/21/b1/photo4jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/39/21/ae/photo1jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/39/21/b4/photo6jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/39/21/af/photo2jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "aggyaggy",
      "user_loc": "香港",
      "bubble": "40",
      "add_time": "2018年10月31日",
      "title": "Nice for photo taking ",
      "content": "Went there with two friends, a bit crowed inside quite a lot of tourists, nice for taking pictures of traditional chinese style buildings ",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/35/c8/d2/yu-garden-yuyuan.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/35/c8/22/yu-garden-yuyuan.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/35/c8/24/yu-garden-yuyuan.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/35/c8/cb/yu-garden-yuyuan.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Amthu",
      "user_loc": "缅甸仰光",
      "bubble": "40",
      "add_time": "2018年10月31日",
      "title": "Go with a tour guide ",
      "content": "The garden is tucked behind Yuyuan bazaar. We went with a tour guide so didn’t have any trouble to find it. I suggest it’s better to go with a tour guide so that you can have insightful knowledge of its history rather than going there to take pictures only. Yu garden is very beautiful although the size is not very big compared to Lingering garden in Suzhou. ",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/35/a1/7a/photo0jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "klb32018",
      "user_loc": "卡罗莱纳州夏洛特",
      "bubble": "20",
      "add_time": "2018年10月18日",
      "title": "Too Touristy",
      "content": "Decent garden and it is a nice slice of tranquility in an otherwise busy city. But the garden is a total tourist trap. Go instead to the former French Concession for free gardens with better food and smaller crowds.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "396charlottee",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月17日",
      "title": "Slice of tranquility",
      "content": "Beautiful gardens with historic buildings and picturesque ponds. A wonderful afternoon had wandering around these pretty gardens. Wonderful opportunity to take some nice photos of my children. They loved watching the giant koi. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Samsgrrl00",
      "user_loc": "加利福尼亚旧金山",
      "bubble": "30",
      "add_time": "2018年10月17日",
      "title": "We went during a Golden Week- DON'T go during a Golden Week",
      "content": "This place is probably very cool to experience, but not on a GOLDEN WEEK-- with a literal million other people. It's beautiful but just getting to the point of entry was crazy. Like a crush of humanity, no organization at the ticket counter- just push and prod your way to the counter. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "annalZ2652MC",
      "user_loc": "新加坡新加坡",
      "bubble": "50",
      "add_time": "2018年10月16日",
      "title": "Ancient garden",
      "content": "The garden has been around for a long time, over a few hundred years. Very splendid. The garden style is that of a private garden, meaning the garden owned by a family has this kind of style in the olden days. We were attracted to the many koi fishes and some terrapins in the pond, which surrounds the garden. If one observes closely there are many fine details in the architecture in the garden. Each window has a different design. The whole garden is ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "marim705",
      "user_loc": "英国伦敦",
      "bubble": "50",
      "add_time": "2018年10月16日",
      "title": "Nice",
      "content": "Really good place , culture , nature , food and shopping near by , not expensive 40 yuans to go in !!! ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Odyssey402460",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月16日",
      "title": "Old China in new Shanghai",
      "content": "This felt like a hidden gem in the middle of the bustle of Shanghai. Although there is usually quite the queue to get into the gardens, this moves quickly and I was distracted by the beautiful surrounds as we approached the entrance. We spent a couple of hours exploring the gardens and the buildings that hold much history.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "J8603YZdaver",
      "user_loc": "佛罗里达博尼塔斯普林斯",
      "bubble": "40",
      "add_time": "2018年10月16日",
      "title": "Brave The Crowds",
      "content": "A bit crowded, but an efficient way to see to see and experience life in a by-gone era--plenty of shops in the adjoining bazaar",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "dkgupta49",
      "user_loc": "印度法里达巴德",
      "bubble": "30",
      "add_time": "2018年10月30日",
      "title": "Nosiy, Confusing",
      "content": "Location : Best to access by Metro. Green line station East Nanjing road (Line No 02). Get down here and catch Line no 10. Yu Garden is the next station. Take exit 3 and follow the crowd.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/33/d8/4b/img-20181028-114057-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/33/d8/48/img-20181028-113854-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/33/d8/4c/img-20181028-114741-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/33/d8/4d/img-20181028-120655-largejpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "tonyw488",
      "user_loc": "澳大利亚Grafton",
      "bubble": "40",
      "add_time": "2018年10月15日",
      "title": "Relax",
      "content": "Take the time to enjoy this space in the middle of Shanghai. Great place to just sit down and forget you are in such a bustling city.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "536rhondam",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月15日",
      "title": "Must see!",
      "content": "Yuyuan Gardens is a must-see spot in Shanghai. The garden itself can be quite crowded, so if you can do a week day excursion, you won’t be sorry. When it’s not crowded, it is a serene gem in the heart of the city. The surrounding buildings & markets are bustling- and although they are only replicas of ancient buildings, the atmosphere is undeniably charming. Be brave- the vendors can be quite assertive & personal space is non-existent- but you can find countless treasures & popular street food, if you are game to elbow in among the locals. If you are so fortunate to visit during Chinese New Year, the Lantern Festival is stunning!",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "sondraw221",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月14日",
      "title": "Old School China",
      "content": "This is the old town of Shanghai. The structures are exactly what you would expect old structures in China to look like. There are some nice walkways, ticky tack shops, and tourist restaurants. It is worth a short visit, but be prepared for the crowds!",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "YOY1",
      "user_loc": "新墨西哥Placitas",
      "bubble": "40",
      "add_time": "2018年10月12日",
      "title": "A beautiful must visit in Shanghai",
      "content": "Yuyuan (Yu Gardens) date back to the Ming Dynasty (16th Century). They city of Shanghai has grown up around it, but the 5 acre gardens are an oasis unto themselves, quite hidden away from the city right outside its walls. I visited during a national Chinese holiday week and while the garden was crowded with visitors, it still maintained a sense of serenity. Strolling the paths from buliding to building evoked a different time and place. I would definitely return.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "egarnier1",
      "user_loc": "法国吕埃—玛尔梅松",
      "bubble": "40",
      "add_time": "2018年10月12日",
      "title": "Very nice garden",
      "content": "This garden is worth a visit when you are in Shanghai. The buildings are well preserved with nice furniture and the atmosphere is quiet and peaceful. Not as nice as the Suzhou gardens though.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "fortonbear",
      "user_loc": "英国斯特劳德",
      "bubble": "50",
      "add_time": "2018年10月12日",
      "title": "A must see",
      "content": "Great architecture and history. Beautiful gardens and fish pools complete with very large koi carp. Despite being quite crowded, very relaxing place to visit. Also, it's free!!",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Wilyfox68",
      "user_loc": "澳大利亚布里斯班",
      "bubble": "50",
      "add_time": "2018年10月11日",
      "title": "Magnificent Garden",
      "content": "This was our favourite sight on our trip to Shanghai partly as we didn't know what to expect. Nestled in Old Shanghai you have little clue from the outside just how fabulous each part of this garden is. Highly recommended!",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "MarciMG",
      "user_loc": "澳大利亚堪培拉",
      "bubble": "40",
      "add_time": "2018年10月9日",
      "title": "Peaceful Garden",
      "content": "This is a lovely garden which is nice and peaceful. It is a joy to walk around and admire the gardens or just sit and enjoy the atmosphere.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "676ginak",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月26日",
      "title": "Worth your time to visit ",
      "content": "On a recent business trip to Shanghai we took a day to tour the city since it was the first time for most of us. We asked our concierge to pick an English tour operator and Cindy was great. They are a small private tour guide in a mini van and not sure the name of company but we stayed at the Hyatt on the Bund. Cindy only does private small groups. We let her tell us what we were seeing and we’re very happy with the tour. We felt Yu Gardens was the highlight because you were in the city but felt like you were transported to another time. The Gardens are over 450 years old and we’re made to look like they are 1000 years old. They did a great job. They added to it in recent years to look like the aged gardens were always there. The buildings and pagodas and landscaping were beautiful. I highly recommend this area for a visit and stop to visit the kiosks along the way to buy unique musical instruments or in the gardens they have some made of china and sell vases and other unique pottery and Jewlery. Don’t miss the tea house near by. ",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/29/51/e9/photo9jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/29/51/e3/photo4jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/29/51/df/photo0jpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/29/51/e5/photo5jpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "ClarissaC429",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月27日",
      "title": "Nice old buildings",
      "content": "The buildings around are very antique and good place to take photos. There are several eateries and place to buy souvenirs.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/2b/4c/b5/20181023-105123-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/2b/4c/be/20181023-111453-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/2b/4c/b7/20181023-105159-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/2b/4c/ba/img-20181023-110145-047.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Dodger52",
      "user_loc": "澳大利亚卧龙岗市",
      "bubble": "50",
      "add_time": "2018年10月9日",
      "title": "Very Peaceful",
      "content": "This garden is well protected from the hurley burley around it by large walls. It is well laid out and very ornate. The crowds make it a bit of a challenge, but well worth a visit",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "N6041QHdavids",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月8日",
      "title": "Crowded ",
      "content": "These gardens are in the old quarter of the city so just getting to them is a fun experience passing all the shops stalks and fast food outlets. The gardens are inexpensive and even cheaper if you are over 60 like me. The big problem is their popularity. There are loads of tour groups but also the tour group leaders will send their party in and wait for them to emerge. So the best time to see the gardens is either very early or late in the afternoon when all the tour groups have gone. As for the garden it is a maze of paths through buildings and rocks over bridges that span waterways. Its a Chinese garden so not many flowers and not a blade of grass. There are koi carp to feed and an exhibition of Chinese art. There is also a shop selling paintings but as soon as you enter you will be followed by a rep eager to sell you a painting. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "erdncksdl",
      "user_loc": "土耳其布尔萨",
      "bubble": "50",
      "add_time": "2018年10月8日",
      "title": "Wonderful place",
      "content": "End of 2016 I stayed in Shangai and also visited Yu Garden. There was very historical buildings and good athmosfere. You can buy lots of things for a gift. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "christasty",
      "user_loc": "澳大利亚珀斯",
      "bubble": "40",
      "add_time": "2018年10月7日",
      "title": "Busy",
      "content": "So busy...",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "suepardesshanna",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月6日",
      "title": "Most beautiful garden",
      "content": "Wonderful garden in Shanghai; Very extensive with different areas; grottos, dragon sculptures, fish ponds, like a massive maze - go with a guide who knows the way !",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "davidmM1261JK",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月6日",
      "title": "Beautiful recitation of old China ",
      "content": "While it’s obviously a recreation and a “tourist trap” with overpriced souvenirs it is also absolutely beautiful and a must see, you can see recreations of ancient architecture and taste local snacks. Don’t forget to finish the tour with a visit of the temple at the end of the street.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "684yaronb",
      "user_loc": "以色列海法区",
      "bubble": "40",
      "add_time": "2018年10月4日",
      "title": "Very nice",
      "content": "The place is nice and quit, with some good relaxing corners. Recommended for relaxing and enjoying a nice garden.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "KentuckyDerbyGirl270",
      "user_loc": "肯塔基Brandenburg",
      "bubble": "40",
      "add_time": "2018年10月4日",
      "title": "Beautiful Garden ",
      "content": "We visited as a family and found the self-guided tour delightful! Entrance was a bit frantic, perhaps because we visited during Golden Week and didn’t realize we still had to wait in the ticket line even though we had purchased tickets online. While we didn’t find it peaceful, we loved the architecture, water gardens and plants! Overall, a delightful way to spend the morning!",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "renesio",
      "user_loc": "菲律宾马尼拉",
      "bubble": "50",
      "add_time": "2018年10月4日",
      "title": "Peaceful and Restful",
      "content": "Our ladies loved the small garden because it was so peaceful in the middle of the Yuyuan Market. Old house and gardens serve a restful stop.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "Star-Monar",
      "user_loc": "",
      "bubble": "20",
      "add_time": "2018年10月22日",
      "title": "Overrated, overcrowded tourist trap",
      "content": "Maybe we were spoilt after two weeks of exploring historic sights in this stunning country, but we couldn't wait to get away from this place. Crowded full of tourists, sellers chasing you and harassing you to buy their fake merchandise and overpriced tacky rubbish... Not for me! The buildings are beautiful and the central square with the fountains and zig zag bridge is well worth a look but other than that steer well clear. Not worth paying to get into the garden either, really overcrowded even on a weekday and pretty underwhelming compared to many other gardens in China. Once you've seen the first courtyard with fish ponds you've seen it all, just more and more of the same.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/20/78/e1/20181012-112644-largejpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "gurbindern2016",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月21日",
      "title": "Worth visiting atleast once",
      "content": "Arrive there in the morning when the garden opens. Price is 40 yuan for one adult. I went at 9am to avoid the rush and even then there was quite a few tour groups. Not a problem if you want to get isolated shots since many of these tour groups move slowly and you can easily just start from the middle. The park covers a small area but because it can be complex, it is tight and can be confusing to navigate. However, it will take possibly more than 2 hours to see everything. I spent an hour and a half and I was going through the garden at a fast pace. Definitely worth a visit. ",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-f/15/1c/9e/9a/img-20181020-092917172.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/1c/9e/97/img-20181020-092114922.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/1c/9e/99/img-20181020-092602723.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/1c/9e/98/img-20181020-092257658.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "davewT6700VR",
      "user_loc": "英国格兰瑟姆",
      "bubble": "50",
      "add_time": "2018年10月3日",
      "title": "Beautiful place to visit",
      "content": "These gardens are not really gardens in the real sence of the word but are well worth a visit. The zig zag bridge is fantasic with all the carp in the ponds below. The buildings are in really old chinese stile and the history is very interesting especially the dragon wall.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "cherylchin",
      "user_loc": "佛罗里达迈阿密",
      "bubble": "40",
      "add_time": "2018年10月3日",
      "title": "Very nice place to visit",
      "content": "Definitely enjoyed these gardens. Very peaceful and relaxing. Wasn't very crowded when we got there Loved the busy shopping area around it. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "marsamchar",
      "user_loc": "英国滨海韦斯顿",
      "bubble": "40",
      "add_time": "2018年10月3日",
      "title": "beautiful",
      "content": "Very calm place with all the symbolism of china: rock and water, zig zag pathways. Not big but easy to lose yourself in its placidity. Watch out for dragons on top of the walls!",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "letsseetheworldnow",
      "user_loc": "新加坡新加坡",
      "bubble": "30",
      "add_time": "2018年10月2日",
      "title": "A bit meh if you ask me",
      "content": "I've heard great things about the garden, but unfortunately, I left feeling underwhelmed. One of the reasons was probably because it was rather crowded when I visited. There are touristy stores outside of the garden if you're looking to buy souvenirs. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "GlennGoh",
      "user_loc": "澳大利亚悉尼",
      "bubble": "50",
      "add_time": "2018年10月2日",
      "title": "A Hidden Surprise in modern Shanghai",
      "content": "A must visit to this few hundred years old building when in Shanghai. It is so well preserved and have so many beautiful gardens. Visitors are treated to the various unique collection of rocks and a fabulous dragon sculpture on top of the wall. Some of the old furnitures are still there (not sure if they're restored ones) but they give us a good glimpse of what's life like in those days. Outside, there are abundant old building structures (mostly tea houses) that represent olden times and they are so elegant. Shopping here is fantastic but you need to bargain hard.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "rebeccagF5764HZ",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月2日",
      "title": "Lovely Gardens",
      "content": "If you are in Shanghai, you definitely want to allow time to visit Yu Garden. We went during school holidays so it was very busy, but if you can, try for a quieter time. It takes a few hours to go through the whole complex as there quite a few little trails off the main track and it is worthwhile exploring them. Make sure you have your walking shoes on. There are many beautiful places to stop for rest if you want to. Do take a bottle of water with you, but if not there is a tea house in the middle of the gardens. Once you exit the main gardens but still inside the main complex there are quite a few gift shops that are also worthwhile exploring. I purchased 2 paintings by a very gifted artist, painted entirely using the hand (no brush). After exiting into the street, there are many shops offering clothing and souvenirs but we elected to go into one of the first shops on our right and upstairs into the most quaint and peaceful little tea house, where the lady working there educated us on all things tea and made us the most delightful iced tea, using dragon tea and osmanthus tea. Very restful after a crowded place and refreshing in the hot weather. Definitely a worthwhile visit!",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "MarkO2798",
      "user_loc": "",
      "bubble": "40",
      "add_time": "2018年10月1日",
      "title": "Nice architecture and relaxed environment.",
      "content": "A pleasant way to spend an hour or two. Pick your time to go as it was busy when we were there. lots of secret pathways through rock formations.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "traveller77722",
      "user_loc": "澳大利亚希望岛",
      "bubble": "40",
      "add_time": "2018年10月1日",
      "title": "Hard to find",
      "content": "We took ages looking for the gardens and the queues to get in once we found it were so long. Nice gardens though but not botanical. Little areas of pretty ponds and serene spots, worth a visit though. ",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "ElPasoMaker",
      "user_loc": "",
      "bubble": "50",
      "add_time": "2018年10月16日",
      "title": "Best picture opportunity in town",
      "content": "It's a small garden but it is truly wonderful especially for photo Ops and then you have some really meet shopping close cry not the typical trinkits but actually more artistic stuff is also available in dusk had crowded in the afternoon so an early on morning visit or late evening would be best.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-f/15/10/c8/92/20181010-093451-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/10/c8/91/20181010-095331-largejpg.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/10/c8/93/20181010-092415-largejpg.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "KVS79",
      "user_loc": "英国南安普敦",
      "bubble": "40",
      "add_time": "2018年10月16日",
      "title": "Go Early",
      "content": "This is a lovely place to visit just off The Bund thoroughly recommend a visit but enjoy it before the crowds get to big. Then explore the shopping area that offers everything you can imagine and more. Very much old and new China.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-s/15/10/66/18/yu-garden-yuyuan.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/10/65/90/yu-garden-yuyuan.jpg",
        "https://ccm.ddcdn.com/ext/photo-s/15/10/65/11/yu-garden-yuyuan.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "rochesterrambler",
      "user_loc": "英国罗契斯特",
      "bubble": "50",
      "add_time": "2018年10月17日",
      "title": "Delightful Garden",
      "content": "It must be said, that this is much more than just 'a garden'. Yes, there are trees and flowers but the buildings and water features etc. add an awful lot more to the experience of your visit.",
      "image_urls": [
        "https://ccm.ddcdn.com/ext/photo-f/15/12/8f/fa/yuyuan-gardens.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/12/8f/eb/yuyuan-gardens.jpg",
        "https://ccm.ddcdn.com/ext/photo-f/15/12/90/0b/yuyuan-gardens.jpg"
      ],
      "language": "en",
      "images": [],
      "image_paths": []
    },
    {
      "username": "CantBeBothered18",
      "user_loc": "澳大利亚阿德莱德",
      "bubble": "40",
      "add_time": "2018年10月1日",
      "title": "Peace in metropolis city",
      "content": "The Yu garden provides tranquility in a busy city.  The architecture was interesting with plenty of examples of feng-shui incorporated.",
      "image_urls": [],
      "language": "en",
      "images": [],
      "image_paths": []
    },
